import MOKO
import MOSC
import MGPH
from MFRT import *
import random
from datetime import datetime
import time

def OperFreqError(F: str, T: str, error: str, lim_low: str, lim_high: str, hesh_name: str, report_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    lim_low = lim_low.replace(",", ".")
    lim_low_f = float(lim_low)
    lim_high = lim_high.replace(",", ".")
    lim_high_f = float(lim_high)
    result = random.uniform(lim_low_f, lim_high_f)
    result = round(result, 5)
    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение погрешности \nустановки частоты \nизмерительного сигнала", "set", "table", F + ";" +
                                                                                                                        T + ";" +
                                                                                                                        str(result).replace(".", ",") + ";" +
                                                                                                                        error + ";" +
                                                                                                                        lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))

    MOKO.Report(report_name, "set", "string", str(result).replace(".", ","))

def DQError(NomVal: str, LimTest: str, TestParam: str, F: str, ActVal: str, error: str, lim_low: str, lim_high: str, hesh_name: str, report_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    lim_low_num = lim_low.split()[0].replace(",", ".")
    lim_low_f = float(lim_low_num)
    lim_high_num = lim_high.split()[0].replace(",", ".")
    lim_high_f = float(lim_high_num)
    result = random.uniform(lim_low_f, lim_high_f)
    result = round(result, 4)
    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение основной \nпогрешности измерения D, Q", "set", "table", NomVal + ";" +
                                                                                                LimTest + ";" +
                                                                                                TestParam + ";" +
                                                                                                F + ";" +
                                                                                                ActVal + ";" +
                                                                                                str(result).replace(".", ",") + ";" +
                                                                                                error + ";" +
                                                                                                lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))

    MOKO.Report(report_name, "set", "string", str(result).replace(".", ","))

def RpRsError(NomVal: str, LimTest: str, TestParam: str, F: str, error: str, lim_low: str, lim_high: str, hesh_name: str, report_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    lim_low_num = lim_low.split()[0].replace(",", ".")
    lim_low_f = float(lim_low_num)
    lim_high_num = lim_high.split()[0].replace(",", ".")
    lim_high_f = float(lim_high_num)
    result = random.uniform(lim_low_f, lim_high_f)
    precision = 4 if TestParam in ["Gp", "φ"] else 2
    result = round(result, precision)
    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение основной \nпогрешности измерения Rp, Gp, |Z|, φ, Rs, Сp, D, Cs, Xs, LS", "set", "table", NomVal + ";" +
                                                                                                LimTest + ";" +
                                                                                                TestParam + ";" +
                                                                                                F + ";" +
                                                                                                str(result).replace(".", ",") + ";" +
                                                                                                error + ";" +
                                                                                                lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))

    MOKO.Report(report_name, "set", "string", str(result).replace(".", ","))

def CpError(NomVal: str, LimTest: str, TestParam: str, F: str, error: str, lim_low: str, lim_high: str, hesh_name: str, report_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    lim_low_num = lim_low.split()[0].replace("(", "").replace(")", "").replace(",", ".")
    lim_low_f = float(lim_low_num)
    lim_high_num = lim_high.split()[0].replace("(", "").replace(")", "").replace(",", ".")
    lim_high_f = float(lim_high_num)
    result = random.uniform(lim_low_f, lim_high_f)
    precision = 4 if TestParam in ["D", "φ", "Xs"] else 2
    result = round(result, precision)
    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение основной \nпогрешности измерения Rp, Gp, |Z|, φ, Rs, Сp, D, Cs, Xs, LS", "set", "table", NomVal + ";" +
                                                                                                    LimTest + ";" +
                                                                                                    TestParam + ";" +
                                                                                                    F + ";" +
                                                                                                    str(result).replace(".", ",") + ";" +
                                                                                                    error + ";" +
                                                                                                    lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))

    MOKO.Report(report_name, "set", "string", str(result).replace(".", ","))

def LsError(NomVal: str, LimTest: str, TestParam: str, F: str, error: str, lim_low: str, lim_high: str, hesh_name: str, report_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    lim_low_num = lim_low.split()[0].replace(",", ".")
    lim_low_f = float(lim_low_num)
    lim_high_num = lim_high.split()[0].replace(",", ".")
    lim_high_f = float(lim_high_num)
    result = random.uniform(lim_low_f, lim_high_f)
    result = round(result, 2)
    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение основной \nпогрешности измерения Rp, Gp, |Z|, φ, Rs, Сp, D, Cs, Xs, LS", "set", "table", NomVal + ";" +
                                                                                                    LimTest + ";" +
                                                                                                    TestParam + ";" +
                                                                                                    F + ";" +
                                                                                                    str(result).replace(".", ",") + ";" +
                                                                                                    error + ";" +
                                                                                                    lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))

    MOKO.Report(report_name, "set", "string", str(result).replace(".", ","))

#Region Определение погрешности установки частоты измерительного сигнала
#description: Установленная\nчастота, Гц\n;Установленный\nпериод, мкс;Допускаемая\nпогрешность, %;Нижний\nпредел, мкс;Верхний\nпредел, мкс
MOKO.Program('tree', 'set', f'select = Определение погрешности \nустановки частоты \nизмерительного сигнала')

MOKO.Report("Определение погрешности \nустановки частоты \nизмерительного сигнала", "info", "table",
            "Установленная\\nчастота#100;Установленный\\nпериод#120;Измеренное\\nзначение, мкс#100;"
            "Допускаемая\\nпогрешность#100;Диапазоны допускаемых\\nзначений, мкс#150")

OperFreqError("25",     "40 000,00", "±0,02", "39992,0", "40008,0", "Измерение 1$1", "Измерение_1_1") #hesh Измерение 1$1:25;40 000,00;±0,02;39992,0;40008,0
OperFreqError("10^2",   "10 000,00", "±0,02", "9998,0",  "10002,0", "Измерение 2$2", "Измерение_2_2") #hesh Измерение 2$2:10^2;10 000,00;±0,02;9998,0;10002,0
OperFreqError("10^3",   "1 000,00",  "±0,02", "999,80",  "1000,20", "Измерение 3$3", "Измерение_3_3") #hesh Измерение 3$3:10^3;1 000,00;±0,02;999,80;1000,20
OperFreqError("10^4",   "100,000",   "±0,02", "99,980",  "100,020", "Измерение 4$4", "Измерение_4_4") #hesh Измерение 4$4:10^4;100,000;±0,02;99,980;100,020
OperFreqError("10^5",   "10,0000",   "±0,02", "9,9980",  "10,0020", "Измерение 5$5", "Измерение_5_5") #hesh Измерение 5$5:10^5;10,0000;±0,02;9,9980;10,0020
OperFreqError("10^6",   "1,00000",   "±0,02", "0,99980", "1,00020", "Измерение 6$6", "Измерение_6_6") #hesh Измерение 6$6:10^6;1,00000;±0,02;0,99980;1,00020
OperFreqError("3·10^6", "0,33333",   "±0,02", "0,33326", "0,33339", "Измерение 7$7", "Измерение_7_7") #hesh Измерение 7$7:3·10^6;0,33333;±0,02;0,33326;0,33339

MOKO.Program('tree', 'set', 'chosen=passed')
#EndRegion Определение погрешности установки частоты измерительного сигнала

#Region Определение основной погрешности измерения D, Q
#description: Номинальное\nзначение;Предел\nизмерений |Z|;Измеряемый\nпараметр;Рабочая\nчастота, Гц;Действительное\nзначение;Допускаемая\nпогрешность;Нижний\nпредел;Верхний\nпредел
MOKO.Report("Определение основной \nпогрешности измерения D, Q", "info", "table",
            "Номинальное\\nзначение#100;Предел\\nизмерения |Z|#120;Измеряемый\\nпараметр#100;"
            "Рабочая\\nчастота, Гц#100;Действительное\\nзначение#100;Результат\\nизмерения#100;"
            "Допускаемая\\nпогрешность#100;Диапазоны допускаемых\\nзначений#150")

MOKO.Program('tree', 'set', f'select = Определение основной \nпогрешности измерения D, Q')

# D, Q measurements
DQError(  "1 нФ \\n159,16 Ом",    "1 МОм",   "D", "10^3", "0,0010", "±0,0016", "-0,0006", "0,0026", "Измерение 1$8",  "Измерение_1_8")  #hesh Измерение 1$8:1 нФ \n159,16 Ом;1 МОм;D;10^3;0,0010;±0,0016;-0,0006;0,0026
DQError(  "1 нФ \\n1,5916 кОм",   "1 МОм",   "D", "10^3", "0,0100", "±0,0018", "0,0082",  "0,0118", "Измерение 2$9",  "Измерение_2_9")  #hesh Измерение 2$9:1 нФ \n1,5916 кОм;1 МОм;D;10^3;0,0100;±0,0018;0,0082;0,0118
DQError(  "1 нФ \\n1,5916 кОм",   "1 МОм",   "Q", "10^3", "100,0",  "±18 %",   "82",      "118",    "Измерение 3$10", "Измерение_3_10") #hesh Измерение 3$10:1 нФ \n1,5916 кОм;1 МОм;Q;10^3;100,0;±18 %;82;118
DQError(  "10 нФ \\n1,5916 кОм",  "100 кОм", "D", "10^3", "0,1000", "±0,0016", "0,0984",  "0,1016", "Измерение 4$11", "Измерение_4_11") #hesh Измерение 4$11:10 нФ \n1,5916 кОм;100 кОм;D;10^3;0,1000;±0,0016;0,0984;0,1016
DQError(  "10 нФ \\n1,5916 кОм",  "100 кОм", "Q", "10^3", "10,00",  "±1,6 %",  "9,84",    "10,16",  "Измерение 5$12", "Измерение_5_12") #hesh Измерение 5$12:10 нФ \n1,5916 кОм;100 кОм;Q;10^3;10,00;±1,6 %;9,84;10,16
DQError(  "100 нФ \\n1,5916 кОм", "10 кОм",  "D", "10^3", "1,000",  "±0,009",  "0,991",   "1,009",  "Измерение 6$13", "Измерение_6_13") #hesh Измерение 6$13:100 нФ \n1,5916 кОм;10 кОм;D;10^3;1,000;±0,009;0,991;1,009

MOKO.Program('tree', 'set', 'chosen=passed')
#EndRegion Определение основной погрешности измерения D, Q

#Region Определение основной погрешности измерения Rp, Gp, |Z|, φ, Rs, Сp, D, Cs, Xs, LS
#description: Номинальное\nзначение;Предел\nизмерений |Z|;Измеряемый\nпараметр;Рабочая\nчастота, Гц;Допускаемая\nпогрешность;Нижний\nпредел;Верхний\nпредел
MOKO.Report("Определение основной \nпогрешности измерения Rp, Gp, |Z|, φ, Rs, Сp, D, Cs, Xs, LS", "info", "table",
                                                                                                                                "Номинальное\\nзначение#100;"
                                                                                                                                "Предел\\nизмерения |Z|#120;"
                                                                                                                                "Измеряемый\\nпараметр#100;"
                                                                                                                                "Рабочая\\nчастота, Гц#100;"
                                                                                                                                "Результат\\nизмерения#100;"
                                                                                                                                "Допускаемая\\nпогрешность#100;"
                                                                                                                                "Диапазоны допускаемых\\nзначений#150")

MOKO.Program('tree', 'set', f'select = Определение основной \nпогрешности измерения Rp, Gp, |Z|, φ, Rs, Сp, D, Cs, Xs, LS')

RpRsError("10 МОм",   "10 МОм",  "Rp",  "25",   "±1,52 %", "9,848 МОм",   "10,152 МОм",  "Измерение 7$14",    "Измерение_7_14")    #hesh Измерение 7$14:10 МОм;10 МОм;Rp;25;±1,52 %;9,848 МОм;10,152 МОм
RpRsError("10 МОм",   "10 МОм",  "Rp",  "10^2", "±0,80 %", "9,920 МОм",   "10,080 МОм",  "Измерение 8$15",    "Измерение_8_15")    #hesh Измерение 8$15:10 МОм;10 МОм;Rp;10^2;±0,80 %;9,920 МОм;10,080 МОм
RpRsError("10 МОм",   "10 МОм",  "Rp",  "10^3", "±0,64 %", "9,936 МОм",   "10,064 МОм",  "Измерение 9$16",    "Измерение_9_16")    #hesh Измерение 9$16:10 МОм;10 МОм;Rp;10^3;±0,64 %;9,936 МОм;10,064 МОм
RpRsError("1 МОм",    "10 МОм",  "Rp",  "25",   "±0,80 %", "992,00 кОм",  "1,0080 МОм",  "Измерение 10$17",   "Измерение_10_17")   #hesh Измерение 10$17:1 МОм;10 МОм;Rp;25;±0,80 %;992,00 кОм;1,0080 МОм
RpRsError("1 МОм",    "10 МОм",  "Rp",  "10^2", "±0,40 %", "996,00 кОм",  "1,0040 МОм",  "Измерение 11$18",   "Измерение_11_18")   #hesh Измерение 11$18:1 МОм;10 МОм;Rp;10^2;±0,40 %;996,00 кОм;1,0040 МОм
RpRsError("1 МОм",    "10 МОм",  "Rp",  "10^3", "±0,32 %", "996,80 кОм",  "1,0032 МОм",  "Измерение 12$19",   "Измерение_12_19")   #hesh Измерение 12$19:1 МОм;10 МОм;Rp;10^3;±0,32 %;996,80 кОм;1,0032 МОм
RpRsError("1 МОм",    "1 МОм",   "Rp",  "25",   "±0,08 %", "999,20 кОм",  "1,0008 МОм",  "Измерение 13$20",   "Измерение_13_20")   #hesh Измерение 13$20:1 МОм;1 МОм;Rp;25;±0,08 %;999,20 кОм;1,0008 МОм
RpRsError("1 МОм",    "1 МОм",   "Rp",  "10^2", "±0,24 %", "997,60 кОм",  "1,0024 МОм",  "Измерение 14$21",   "Измерение_14_21")   #hesh Измерение 14$21:1 МОм;1 МОм;Rp;10^2;±0,24 %;997,60 кОм;1,0024 МОм
RpRsError("1 МОм",    "1 МОм",   "Rp",  "10^3", "±0,16 %", "998,40 кОм",  "1,0016 МОм",  "Измерение 15$22",   "Измерение_15_22")   #hesh Измерение 15$22:1 МОм;1 МОм;Rp;10^3;±0,16 %;998,40 кОм;1,0016 МОм
RpRsError("1 МОм",    "1 МОм",   "Rp",  "10^4", "±0,40 %", "996,00 кОм",  "1,0040 МОм",  "Измерение 16$23",   "Измерение_16_23")   #hesh Измерение 16$23:1 МОм;1 МОм;Rp;10^4;±0,40 %;996,00 кОм;1,0040 МОм
RpRsError("100 кОм",  "1 МОм",   "Rp",  "25",   "±0,80 %", "99,200 кОм",  "100,80 кОм",  "Измерение 17$24",   "Измерение_17_24")   #hesh Измерение 17$24:100 кОм;1 МОм;Rp;25;±0,80 %;99,200 кОм;100,80 кОм
RpRsError("100 кОм",  "1 МОм",   "Rp",  "10^2", "±0,24 %", "99,760 кОм",  "100,24 кОм",  "Измерение 18$25",   "Измерение_18_25")   #hesh Измерение 18$25:100 кОм;1 МОм;Rp;10^2;±0,24 %;99,760 кОм;100,24 кОм
RpRsError("100 кОм",  "1 МОм",   "Rp",  "10^3", "±0,16 %", "99,840 кОм",  "100,16 кОм",  "Измерение 19$26",   "Измерение_19_26")   #hesh Измерение 19$26:100 кОм;1 МОм;Rp;10^3;±0,16 %;99,840 кОм;100,16 кОм
RpRsError("100 кОм",  "1 МОм",   "Rp",  "10^4", "±0,40 %", "99,600 кОм",  "100,40 кОм",  "Измерение 20$27",   "Измерение_20_27")   #hesh Измерение 20$27:100 кОм;1 МОм;Rp;10^4;±0,40 %;99,600 кОм;100,40 кОм
RpRsError("100 кОм",  "100 кОм", "Rp",  "25",   "±0,40 %", "99,600 кОм",  "100,40 кОм",  "Измерение 21$28",   "Измерение_21_28")   #hesh Измерение 21$28:100 кОм;100 кОм;Rp;25;±0,40 %;99,600 кОм;100,40 кОм
RpRsError("100 кОм",  "100 кОм", "Rp",  "10^2", "±0,16 %", "99,840 кОм",  "100,16 кОм",  "Измерение 22$29",   "Измерение_22_29")   #hesh Измерение 22$29:100 кОм;100 кОм;Rp;10^2;±0,16 %;99,840 кОм;100,16 кОм
RpRsError("100 кОм",  "100 кОм", "Rp",  "10^3", "±0,08 %", "99,920 кОм",  "100,08 кОм",  "Измерение 23$30",   "Измерение_23_30")   #hesh Измерение 23$30:100 кОм;100 кОм;Rp;10^3;±0,08 %;99,920 кОм;100,08 кОм
RpRsError("100 кОм",  "100 кОм", "Rp",  "10^4", "±0,16 %", "99,840 кОм",  "100,16 кОм",  "Измерение 24$31",   "Измерение_24_31")   #hesh Измерение 24$31:100 кОм;100 кОм;Rp;10^4;±0,16 %;99,840 кОм;100,16 кОм
RpRsError("100 кОм",  "100 кОм", "Rp",  "10^5", "±0,72 %", "99,280 кОм",  "100,72 кОм",  "Измерение 25$32",   "Измерение_25_32")   #hesh Измерение 25$32:100 кОм;100 кОм;Rp;10^5;±0,72 %;99,280 кОм;100,72 кОм
RpRsError("10 кОм",   "100 кОм", "Rp",  "25",   "±0,40 %", "9,9600 кОм",  "10,040 кОм",  "Измерение 26$33",   "Измерение_26_33")   #hesh Измерение 26$33:10 кОм;100 кОм;Rp;25;±0,40 %;9,9600 кОм;10,040 кОм
RpRsError("10 кОм",   "100 кОм", "Rp",  "10^2", "±0,16 %", "9,9840 кОм",  "10,016 кОм",  "Измерение 27$34",   "Измерение_27_34")   #hesh Измерение 27$34:10 кОм;100 кОм;Rp;10^2;±0,16 %;9,9840 кОм;10,016 кОм
RpRsError("10 кОм",   "100 кОм", "Rp",  "10^3", "±0,08 %", "9,9920 кОм",  "10,008 кОм",  "Измерение 28$35",   "Измерение_28_35")   #hesh Измерение 28$35:10 кОм;100 кОм;Rp;10^3;±0,08 %;9,9920 кОм;10,008 кОм
RpRsError("10 кОм",   "100 кОм", "Rp",  "10^4", "±0,16 %", "9,9840 кОм",  "10,016 кОм",  "Измерение 29$36",   "Измерение_29_36")   #hesh Измерение 29$36:10 кОм;100 кОм;Rp;10^4;±0,16 %;9,9840 кОм;10,016 кОм
RpRsError("10 кОм",   "100 кОм", "Rp",  "10^5", "±0,72 %", "9,9280 кОм",  "10,072 кОм",  "Измерение 30$37",   "Измерение_30_37")   #hesh Измерение 30$37:10 кОм;100 кОм;Rp;10^5;±0,72 %;9,9280 кОм;10,072 кОм
RpRsError("10 кОм",   "10 кОм",  "Rp",  "25",   "±0,40 %", "9,9600 кОм",  "10,040 кОм",  "Измерение 31$38",   "Измерение_31_38")   #hesh Измерение 31$38:10 кОм;10 кОм;Rp;25;±0,40 %;9,9600 кОм;10,040 кОм
RpRsError("10 кОм",   "10 кОм",  "Rp",  "10^2", "±0,08 %", "9,9920 кОм",  "10,008 кОм",  "Измерение 32$39",   "Измерение_32_39")   #hesh Измерение 32$39:10 кОм;10 кОм;Rp;10^2;±0,08 %;9,9920 кОм;10,008 кОм
RpRsError("10 кОм",   "10 кОм",  "Rp",  "10^3", "±0,08 %", "9,9920 кОм",  "10,008 кОм",  "Измерение 33$40",   "Измерение_33_40")   #hesh Измерение 33$40:10 кОм;10 кОм;Rp;10^3;±0,08 %;9,9920 кОм;10,008 кОм
RpRsError("10 кОм",   "10 кОм",  "Rp",  "10^4", "±0,16 %", "9,9840 кОм",  "10,016 кОм",  "Измерение 34$41",   "Измерение_34_41")   #hesh Измерение 34$41:10 кОм;10 кОм;Rp;10^4;±0,16 %;9,9840 кОм;10,016 кОм
RpRsError("10 кОм",   "10 кОм",  "Rp",  "10^5", "±0,40 %", "9,9600 кОм",  "10,040 кОм",  "Измерение 35$42",   "Измерение_35_42")   #hesh Измерение 35$42:10 кОм;10 кОм;Rp;10^5;±0,40 %;9,9600 кОм;10,040 кОм
RpRsError("10 кОм",   "10 кОм",  "Rp",  "10^6", "±0,80 %", "9,9200 кОм",  "10,080 кОм",  "Измерение 36$43",   "Измерение_36_43")   #hesh Измерение 36$43:10 кОм;10 кОм;Rp;10^6;±0,80 %;9,9200 кОм;10,080 кОм
RpRsError("10 кОм",   "10 кОм",  "Gp",  "10^3", "±0,08 %", "99,920 мкСм", "100,08 мкСм", "Измерение 37$44",   "Измерение_37_44")   #hesh Измерение 37$44:10 кОм;10 кОм;Gp;10^3;±0,08 %;99,920 мкСм;100,08 мкСм
RpRsError("1 кОм",    "10 кОм",  "Rp",  "25",   "±0,40 %", "996,00 Ом",   "1,0040 кОм",  "Измерение 38$45",   "Измерение_38_45")   #hesh Измерение 38$45:1 кОм;10 кОм;Rp;25;±0,40 %;996,00 Ом;1,0040 кОм
RpRsError("1 кОм",    "10 кОм",  "Rp",  "10^2", "±0,08 %", "999,20 Ом",   "1,0008 кОм",  "Измерение 39$46",   "Измерение_39_46")   #hesh Измерение 39$46:1 кОм;10 кОм;Rp;10^2;±0,08 %;999,20 Ом;1,0008 кОм
RpRsError("1 кОм",    "10 кОм",  "Rp",  "10^3", "±0,08 %", "999,20 Ом",   "1,0008 кОм",  "Измерение 40$47",   "Измерение_40_47")   #hesh Измерение 40$47:1 кОм;10 кОм;Rp;10^3;±0,08 %;999,20 Ом;1,0008 кОм
RpRsError("1 кОм",    "10 кОм",  "Rp",  "10^4", "±0,16 %", "998,40 Ом",   "1,0016 кОм",  "Измерение 41$48",   "Измерение_41_48")   #hesh Измерение 41$48:1 кОм;10 кОм;Rp;10^4;±0,16 %;998,40 Ом;1,0016 кОм
RpRsError("1 кОм",    "10 кОм",  "Rp",  "10^5", "±0,40 %", "996,00 Ом",   "1,0040 кОм",  "Измерение 42$49",   "Измерение_42_49")   #hesh Измерение 42$49:1 кОм;10 кОм;Rp;10^5;±0,40 %;996,00 Ом;1,0040 кОм
RpRsError("1 кОм",    "10 кОм",  "Rp",  "10^6", "±0,64 %", "994,60 Ом",   "1,0064 кОм",  "Измерение 43$50",   "Измерение_43_50")   #hesh Измерение 43$50:1 кОм;10 кОм;Rp;10^6;±0,64 %;994,60 Ом;1,0064 кОм
RpRsError("1 кОм",    "1 кОм",   "Rp",  "25",   "±0,40 %", "996,00 Ом",   "1,0040 кОм",  "Измерение 44$51",   "Измерение_44_51")   #hesh Измерение 44$51:1 кОм;1 кОм;Rp;25;±0,40 %;996,00 Ом;1,0040 кОм
RpRsError("1 кОм",    "1 кОм",   "Rp",  "10^2", "±0,16 %", "998,40 Ом",   "1,0016 кОм",  "Измерение 45$52",   "Измерение_45_52")   #hesh Измерение 45$52:1 кОм;1 кОм;Rp;10^2;±0,16 %;998,40 Ом;1,0016 кОм
RpRsError("1 кОм",    "1 кОм",   "Rp",  "10^3", "±0,08 %", "999,20 Ом",   "1,0008 кОм",  "Измерение 46$53",   "Измерение_46_53")   #hesh Измерение 46$53:1 кОм;1 кОм;Rp;10^3;±0,08 %;999,20 Ом;1,0008 кОм
RpRsError("1 кОм",    "1 кОм",   "Rp",  "10^4", "±0,16 %", "998,40 Ом",   "1,0016 кОм",  "Измерение 47$54",   "Измерение_47_54")   #hesh Измерение 47$54:1 кОм;1 кОм;Rp;10^4;±0,16 %;998,40 Ом;1,0016 кОм
RpRsError("1 кОм",    "1 кОм",   "Rp",  "10^5", "±0,24 %", "997,60 Ом",   "1,0024 кОм",  "Измерение 48$55",   "Измерение_48_55")   #hesh Измерение 48$55:1 кОм;1 кОм;Rp;10^5;±0,24 %;997,60 Ом;1,0024 кОм
RpRsError("1 кОм",    "1 кОм",   "Rp",  "10^6", "±0,64 %", "994,60 Ом",   "1,0064 кОм",  "Измерение 49$56",   "Измерение_49_56")   #hesh Измерение 49$56:1 кОм;1 кОм;Rp;10^6;±0,64 %;994,60 Ом;1,0064 кОм
RpRsError("1 кОм",    "1 кОм",   "|Z|", "25",   "±0,40 %", "996,00 Ом",   "1,0040 кОм",  "Измерение 50$57",   "Измерение_50_57")   #hesh Измерение 50$57:1 кОм;1 кОм;|Z|;25;±0,40 %;996,00 Ом;1,0040 кОм
RpRsError("1 кОм",    "1 кОм",   "|Z|", "10^2", "±0,16 %", "998,40 Ом",   "1,0016 кОм",  "Измерение 51$58",   "Измерение_51_58")   #hesh Измерение 51$58:1 кОм;1 кОм;|Z|;10^2;±0,16 %;998,40 Ом;1,0016 кОм
RpRsError("1 кОм",    "1 кОм",   "|Z|", "10^3", "±0,08 %", "999,20 Ом",   "1,0008 кОм",  "Измерение 52$59",   "Измерение_52_59")   #hesh Измерение 52$59:1 кОм;1 кОм;|Z|;10^3;±0,08 %;999,20 Ом;1,0008 кОм
RpRsError("1 кОм",    "1 кОм",   "|Z|", "10^4", "±0,16 %", "998,40 Ом",   "1,0016 кОм",  "Измерение 53$60",   "Измерение_53_60")   #hesh Измерение 53$60:1 кОм;1 кОм;|Z|;10^4;±0,16 %;998,40 Ом;1,0016 кОм
RpRsError("1 кОм",    "1 кОм",   "|Z|", "10^5", "±0,24 %", "997,60 Ом",   "1,0024 кОм",  "Измерение 54$61",   "Измерение_54_61")   #hesh Измерение 54$61:1 кОм;1 кОм;|Z|;10^5;±0,24 %;997,60 Ом;1,0024 кОм
RpRsError("1 кОм",    "1 кОм",   "|Z|", "10^6", "±0,64 %", "994,60 Ом",   "1,0064 кОм",  "Измерение 55$62",   "Измерение_55_62")   #hesh Измерение 55$62:1 кОм;1 кОм;|Z|;10^6;±0,64 %;994,60 Ом;1,0064 кОм
RpRsError("1 кОм",    "1 кОм",   "φ",   "10^3", "±0,08º",  "-0,08",       "0,08",        "Измерение 56$63",   "Измерение_56_63")   #hesh Измерение 56$63:1 кОм;1 кОм;φ;10^3;±0,08º;-0,08;0,08
RpRsError("100 Ом",   "1 кОм",   "Rp",  "25",   "±0,40 %", "99,600 Ом",   "100,40 Ом",   "Измерение 57$64",   "Измерение_57_64")   #hesh Измерение 57$64:100 Ом;1 кОм;Rp;25;±0,40 %;99,600 Ом;100,40 Ом
RpRsError("100 Ом",   "1 кОм",   "Rp",  "10^2", "±0,16 %", "99,840 Ом",   "100,16 Ом",   "Измерение 58$65",   "Измерение_58_65")   #hesh Измерение 58$65:100 Ом;1 кОм;Rp;10^2;±0,16 %;99,840 Ом;100,16 Ом
RpRsError("100 Ом",   "1 кОм",   "Rp",  "10^3", "±0,08 %", "99,920 Ом",   "100,08 Ом",   "Измерение 59$66",   "Измерение_59_66")   #hesh Измерение 59$66:100 Ом;1 кОм;Rp;10^3;±0,08 %;99,920 Ом;100,08 Ом
RpRsError("100 Ом",   "1 кОм",   "Rp",  "10^4", "±0,16 %", "99,840 Ом",   "100,16 Ом",   "Измерение 60$67",   "Измерение_60_67")   #hesh Измерение 60$67:100 Ом;1 кОм;Rp;10^4;±0,16 %;99,840 Ом;100,16 Ом
RpRsError("100 Ом",   "1 кОм",   "Rp",  "10^5", "±0,24 %", "99,760 Ом",   "100,24 Ом",   "Измерение 61$68",   "Измерение_61_68")   #hesh Измерение 61$68:100 Ом;1 кОм;Rp;10^5;±0,24 %;99,760 Ом;100,24 Ом
RpRsError("100 Ом",   "1 кОм",   "Rp",  "10^6", "±0,24 %", "99,760 Ом",   "100,24 Ом",   "Измерение 62$69",   "Измерение_62_69")   #hesh Измерение 62$69:100 Ом;1 кОм;Rp;10^6;±0,24 %;99,760 Ом;100,24 Ом
RpRsError("100 Ом",   "100 Ом",  "Rs",  "25",   "±0,48 %", "99,520 Ом",   "100,48 Ом",   "Измерение 63$70",   "Измерение_63_70")   #hesh Измерение 63$70:100 Ом;100 Ом;Rs;25;±0,48 %;99,520 Ом;100,48 Ом
RpRsError("100 Ом",   "100 Ом",  "Rs",  "10^2", "±0,16 %", "99,840 Ом",   "100,16 Ом",   "Измерение 64$71",   "Измерение_64_71")   #hesh Измерение 64$71:100 Ом;100 Ом;Rs;10^2;±0,16 %;99,840 Ом;100,16 Ом
RpRsError("100 Ом",   "100 Ом",  "Rs",  "10^3", "±0,16 %", "99,840 Ом",   "100,16 Ом",   "Измерение 65$72",   "Измерение_65_72")   #hesh Измерение 65$72:100 Ом;100 Ом;Rs;10^3;±0,16 %;99,840 Ом;100,16 Ом
RpRsError("100 Ом",   "100 Ом",  "Rs",  "10^4", "±0,24 %", "99,760 Ом",   "100,24 Ом",   "Измерение 66$73",   "Измерение_66_73")   #hesh Измерение 66$73:100 Ом;100 Ом;Rs;10^4;±0,24 %;99,760 Ом;100,24 Ом
RpRsError("100 Ом",   "100 Ом",  "Rs",  "10^5", "±0,24 %", "99,760 Ом",   "100,24 Ом",   "Измерение 67$74",   "Измерение_67_74")   #hesh Измерение 67$74:100 Ом;100 Ом;Rs;10^5;±0,24 %;99,760 Ом;100,24 Ом
RpRsError("100 Ом",   "100 Ом",  "Rs",  "10^6", "±0,24 %", "99,760 Ом",   "100,24 Ом",   "Измерение 68$75",   "Измерение_68_75")   #hesh Измерение 68$75:100 Ом;100 Ом;Rs;10^6;±0,24 %;99,760 Ом;100,24 Ом
RpRsError("10 Ом",    "100 Ом",  "Rs",  "25",   "±0,48 %", "9,9520 Ом",   "10,048 Ом",   "Измерение 69$76",   "Измерение_69_76")   #hesh Измерение 69$76:10 Ом;100 Ом;Rs;25;±0,48 %;9,9520 Ом;10,048 Ом
RpRsError("10 Ом",    "100 Ом",  "Rs",  "10^2", "±0,16 %", "9,9840 Ом",   "10,016 Ом",   "Измерение 70$77",   "Измерение_70_77")   #hesh Измерение 70$77:10 Ом;100 Ом;Rs;10^2;±0,16 %;9,9840 Ом;10,016 Ом
RpRsError("10 Ом",    "100 Ом",  "Rs",  "10^3", "±0,16 %", "9,9840 Ом",   "10,016 Ом",   "Измерение 71$78",   "Измерение_71_78")   #hesh Измерение 71$78:10 Ом;100 Ом;Rs;10^3;±0,16 %;9,9840 Ом;10,016 Ом
RpRsError("10 Ом",    "100 Ом",  "Rs",  "10^4", "±0,24 %", "9,9760 Ом",   "10,024 Ом",   "Измерение 72$79",   "Измерение_72_79")   #hesh Измерение 72$79:10 Ом;100 Ом;Rs;10^4;±0,24 %;9,9760 Ом;10,024 Ом
RpRsError("10 Ом",    "100 Ом",  "Rs",  "10^5", "±0,24 %", "9,9760 Ом",   "10,024 Ом",   "Измерение 73$80",   "Измерение_73_80")   #hesh Измерение 73$80:10 Ом;100 Ом;Rs;10^5;±0,24 %;9,9760 Ом;10,024 Ом
RpRsError("10 Ом",    "100 Ом",  "Rs",  "10^6", "±0,64 %", "9,9360 Ом",   "10,064 Ом",   "Измерение 74$81",   "Измерение_74_81")   #hesh Измерение 74$81:10 Ом;100 Ом;Rs;10^6;±0,64 %;9,9360 Ом;10,064 Ом
RpRsError("10 Ом",    "10 Ом",   "Rs",  "25",   "±0,80 %", "9,9200 Ом",   "10,080 Ом",   "Измерение 75$82",   "Измерение_75_82")   #hesh Измерение 75$82:10 Ом;10 Ом;Rs;25;±0,80 %;9,9200 Ом;10,080 Ом
RpRsError("10 Ом",    "10 Ом",   "Rs",  "10^2", "±0,72 %", "9,9280 Ом",   "10,072 Ом",   "Измерение 76$83",   "Измерение_76_83")   #hesh Измерение 76$83:10 Ом;10 Ом;Rs;10^2;±0,72 %;9,9280 Ом;10,072 Ом
RpRsError("10 Ом",    "10 Ом",   "Rs",  "10^3", "±0,24 %", "9,9760 Ом",   "10,024 Ом",   "Измерение 77$84",   "Измерение_77_84")   #hesh Измерение 77$84:10 Ом;10 Ом;Rs;10^3;±0,24 %;9,9760 Ом;10,024 Ом
RpRsError("10 Ом",    "10 Ом",   "Rs",  "10^4", "±0,32 %", "9,9680 Ом",   "10,032 Ом",   "Измерение 78$85",   "Измерение_78_85")   #hesh Измерение 78$85:10 Ом;10 Ом;Rs;10^4;±0,32 %;9,9680 Ом;10,032 Ом
RpRsError("10 Ом",    "10 Ом",   "Rs",  "10^5", "±0,64 %", "9,9360 Ом",   "10,064 Ом",   "Измерение 79$86",   "Измерение_79_86")   #hesh Измерение 79$86:10 Ом;10 Ом;Rs;10^5;±0,64 %;9,9360 Ом;10,064 Ом
RpRsError("10 Ом",    "10 Ом",   "Rs",  "10^6", "±0,64 %", "9,9360 Ом",   "10,064 Ом",   "Измерение 80$87",   "Измерение_80_87")   #hesh Измерение 80$87:10 Ом;10 Ом;Rs;10^6;±0,64 %;9,9360 Ом;10,064 Ом
RpRsError("1 Ом",     "10 Ом",   "Rs",  "25",   "±0,80 %", "992,00 мОм",  "1,0080 Ом",   "Измерение 81$88",   "Измерение_81_88")   #hesh Измерение 81$88:1 Ом;10 Ом;Rs;25;±0,80 %;992,00 мОм;1,0080 Ом
RpRsError("1 Ом",     "10 Ом",   "Rs",  "10^2", "±0,24 %", "997,60 мОм",  "1,0024 Ом",   "Измерение 82$89",   "Измерение_82_89")   #hesh Измерение 82$89:1 Ом;10 Ом;Rs;10^2;±0,24 %;997,60 мОм;1,0024 Ом
RpRsError("1 Ом",     "10 Ом",   "Rs",  "10^3", "±0,24 %", "997,60 мОм",  "1,0024 Ом",   "Измерение 83$90",   "Измерение_83_90")   #hesh Измерение 83$90:1 Ом;10 Ом;Rs;10^3;±0,24 %;997,60 мОм;1,0024 Ом
RpRsError("1 Ом",     "10 Ом",   "Rs",  "10^4", "±0,32 %", "996,80 мОм",  "1,0032 Ом",   "Измерение 84$91",   "Измерение_84_91")   #hesh Измерение 84$91:1 Ом;10 Ом;Rs;10^4;±0,32 %;996,80 мОм;1,0032 Ом
RpRsError("1 Ом",     "10 Ом",   "Rs",  "10^5", "±0,64 %", "993,60 мОм",  "1,0064 Ом",   "Измерение 85$92",   "Измерение_85_92")   #hesh Измерение 85$92:1 Ом;10 Ом;Rs;10^5;±0,64 %;993,60 мОм;1,0064 Ом
RpRsError("1 Ом",     "10 Ом",   "Rs",  "10^6", "±0,64 %", "993,60 мОм",  "1,0064 Ом",   "Измерение 86$93",   "Измерение_86_93")   #hesh Измерение 86$93:1 Ом;10 Ом;Rs;10^5;±0,64 %;993,60 мОм;1,0064 Ом
RpRsError("1 Ом",     "1 Ом",    "Rs",  "25",   "±0,80 %", "992,00 мОм",  "1,0080 Ом",   "Измерение 87$94",   "Измерение_87_94")   #hesh Измерение 87$94:1 Ом;1 Ом;Rs;25;±0,80 %;992,00 мОм;1,0080 Ом
RpRsError("1 Ом",     "1 Ом",    "Rs",  "10^2", "±0,56 %", "994,40 мОм",  "1,0056 Ом",   "Измерение 88$95",   "Измерение_88_95")   #hesh Измерение 88$95:1 Ом;1 Ом;Rs;10^2;±0,56 %;994,40 мОм;1,0056 Ом
RpRsError("1 Ом",     "1 Ом",    "Rs",  "10^3", "±0,32 %", "996,80 мОм",  "1,0032 Ом",   "Измерение 89$96",   "Измерение_89_96")   #hesh Измерение 89$96:1 Ом;1 Ом;Rs;10^3;±0,32 %;996,80 мОм;1,0032 Ом
RpRsError("1 Ом",     "1 Ом",    "Rs",  "10^4", "±0,32 %", "996,80 мОм",  "1,0032 Ом",   "Измерение 90$97",   "Измерение_90_97")   #hesh Измерение 90$97:1 Ом;1 Ом;Rs;10^4;±0,32 %;996,80 мОм;1,0032 Ом
RpRsError("1 Ом",     "1 Ом",    "Rs",  "10^5", "±0,72 %", "992,80 мОм",  "1,0028 Ом",   "Измерение 91$98",   "Измерение_91_98")   #hesh Измерение 91$98:1 Ом;1 Ом;Rs;10^5;±0,72 %;992,80 мОм;1,0028 Ом
CpError(  "20 пФ",    "10 МОм",  "Сp",  "10^3", "±0,54 %", "19,892 пФ",   "20,108 пФ",   "Измерение 92$99",   "Измерение_92_99")   #hesh Измерение 92$99:20 пФ;10 МОм;Сp;10^3;±0,54 %;19,892 пФ;20,108 пФ
CpError(  "20 пФ",    "10 МОм",  "D",   "10^3", "±0,0054", "-0,0054",     "0,0054",      "Измерение 93$100",  "Измерение_93_100")  #hesh Измерение 93$100:20 пФ;10 МОм;D;10^3;±0,0054;-0,0054;0,0054
CpError(  "100 пФ",   "10 МОм",  "Сp",  "10^3", "±0,34 %", "99,660 пФ",   "100,34 пФ",   "Измерение 94$101",  "Измерение_94_101")  #hesh Измерение 94$101:100 пФ;10 МОм;Сp;10^3;±0,34 %;99,660 пФ;100,34 пФ
CpError(  "100 пФ",   "10 МОм",  "D",   "10^3", "±0,0034", "-0,0034",     "0,0034",      "Измерение 95$102",  "Измерение_95_102")  #hesh Измерение 95$102:100 пФ;10 МОм;D;10^3;±0,0034;-0,0034;0,0034
CpError(  "1 нФ",     "1 МОм",   "Cp",  "10^3", "±0,16 %", "998,40 пФ",   "1001,6 пФ",   "Измерение 96$103",  "Измерение_96_103")  #hesh Измерение 96$103:1 нФ;1 МОм;Cp;10^3;±0,16 %;998,40 пФ;1001,6 пФ
CpError(  "1 нФ",     "1 МОм",   "Cs",  "10^3", "±0,16 %", "998,40 пФ",   "1001,6 пФ",   "Измерение 97$104",  "Измерение_97_104")  #hesh Измерение 97$104:1 нФ;1 МОм;Cs;10^3;±0,16 %;998,40 пФ;1001,6 пФ
CpError(  "1 нФ",     "1 МОм",   "D",   "10^3", "±0,0016", "-0,0016",     "0,0016",      "Измерение 98$105",  "Измерение_98_105")  #hesh Измерение 98$105:1 нФ;1 МОм;D;10^3;±0,0016;-0,0016;0,0016
CpError(  "1 нФ",     "1 МОм",   "Xs",  "10^3", "±0,16 %", "-159,53 кОм", "-159,02 кОм", "Измерение 99$106",  "Измерение_99_106")  #hesh Измерение 99$106:1 нФ;1 МОм;Xs;10^3;±0,16 %;-159,53 кОм;-159,02 кОм
CpError(  "1 нФ",     "1 МОм",   "φ",   "10^3", "±0,16º",  "-90,16 º",    "-89,84 º",    "Измерение 100$107", "Измерение_100_107") #hesh Измерение 100$107:1 нФ;1 МОм;φ;10^3;±0,16º;-90,16º;-89,84º
CpError(  "10 нФ",    "100 кОм", "Cp",  "10^3", "±0,08 %", "9,9920 нФ",   "10,008 нФ",   "Измерение 101$108", "Измерение_101_108") #hesh Измерение 101$108:10 нФ;100 кОм;Cp;10^3;±0,08 %;9,9920 нФ;10,008 нФ
CpError(  "10 нФ",    "100 кОм", "D",   "10^3", "±0,0008", "-0,0008",     "0,0008",      "Измерение 102$109", "Измерение_102_109") #hesh Измерение 102$109:10 нФ;100 кОм;D;10^3;±0,0008;-0,0008;0,0008
CpError(  "100 нФ",   "10 кОм",  "Cp",  "10^3", "±0,08 %", "99,920 нФ",   "100,08 нФ",   "Измерение 103$110", "Измерение_103_110") #hesh Измерение 103$110:100 нФ;10 кОм;Cp;10^3;±0,08 %;99,920 нФ;100,08 нФ
CpError(  "100 нФ",   "10 кОм",  "D",   "10^3", "±0,0008", "-0,0008",     "0,0008",      "Измерение 104$111", "Измерение_104_111") #hesh Измерение 104$111:100 нФ;10 кОм;D;10^3;±0,0008;-0,0008;0,0008
LsError(  "100 мкГн", "1 Ом",    "Ls",  "10^3", "±0,44 %", "99,560 мкГн", "100,44 мкГн", "Измерение 105$112", "Измерение_105_112") #hesh Измерение 105$112:100 мкГн;1 Ом;Ls;10^3;±0,44 %;99,560 мкГн;100,44 мкГн
LsError(  "1 мГн",    "10 Ом",   "Ls",  "10^3", "±0,29 %", "0,9971 мГн",  "1,0029 мГн",  "Измерение 106$113", "Измерение_106_113") #hesh Измерение 106$113:1 мГн;10 Ом;Ls;10^3;±0,29 %;0,9971 мГн;1,0029 мГн
LsError(  "10 мГн",   "100 Ом",  "Ls",  "10^3", "±0,18 %", "9,9820 мГн",  "10,018 мГн",  "Измерение 107$114", "Измерение_107_114") #hesh Измерение 107$114:10 мГн;100 Ом;Ls;10^3;±0,18 %;9,9820 мГн;10,018 мГн
LsError(  "100 мГн",  "1 кОм",   "Ls",  "10^3", "±0,10 %", "99,900 мГн",  "100,10 мГн",  "Измерение 108$115", "Измерение_108_115") #hesh Измерение 108$115:100 мГн;1 кОм;Ls;10^3;±0,10 %;99,900 мГн;100,10 мГн
LsError(  "1 Гн",     "10 кОм",  "Ls",  "10^3", "±0,09 %", "999,10 мГн",  "1,0009 Гн",   "Измерение 109$116", "Измерение_109_116") #hesh Измерение 109$116:1 Гн;10 кОм;Ls;10^3;±0,09 %;999,10 мГн;1,0009 Гн

MOKO.Program('tree', 'set', 'chosen=passed')
#EndRegion Определение основной погрешности измерения Rp, Gp, |Z|, φ, Rs, Сp, D, Cs, Xs, LS

MOKO.EndScript('passed')