import MOKO
import MOSC
import MGPH
from MFRT import *
import random
from datetime import datetime
import time



def OperFreqError(F:str, T: str, error: str, lim_low:str, lim_high:str, hesh_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    lim_low = lim_low.replace(",", ".")
    lim_low_f = float(lim_low)

    lim_high = lim_high.replace(",", ".")
    lim_high_f = float(lim_high)
    result = random.uniform(lim_low_f, lim_high_f)
    result = round(result, 5)


    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение погрешности \nустановки рабочей частоты", "set", "table", F + ";" +
                                                                                                         T + ";" +
                                                                                                         str(result).replace(".", ",") + ";" +
                                                                                                         error + ";" +
                                                                                                         lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))



def RpRsError(NomVal: str, LimTest: str, TestParam: str, F: str, error: str, lim_low:str, lim_high:str, hesh_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')

    lim_low_num = lim_low.split()[0]
    lim_low_num = lim_low_num.replace(",", ".")
    lim_low_f = float(lim_low_num)

    lim_high_num = lim_high_num.split()[0]
    lim_high_num = lim_high_num.replace(",", ".")
    lim_high_f = float(lim_high_num)
    result = random.uniform(lim_low_f, lim_high_f)
    result = round(result, 2)

    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение основной \\nпогрешности измерения \\nпараметров Rp, Rs", "set", "table",  NomVal + ";" +
                                                                                                                        LimTest + ";" +
                                                                                                                        TestParam + ";" +
                                                                                                                        F + ";" +
                                                                                                                        str(result).replace(".", ",") + ";" +
                                                                                                                        error + ";" +
                                                                                                                        lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))


#Region Определение погрешности \nустановки рабочей частоты
#description: Установленная\nчастота, Гц\n;Установленный\nпериод, мкс;Допускаемая\nпогрешность, %;Нижний\nпредел, мкс;Верхний\nпредел, мкс

MOKO.Program('tree', 'set', f'select = Определение погрешности \\nустановки рабочей частоты')

MOKO.Report("Определение погрешности \nустановки рабочей частоты", "info", "table", "Установленная\\nчастота#100;"
                                                                                                           "Установленный\\nпериод#120;"
                                                                                                           "Измеренное\\nзначение, мкс#100;"
                                                                                                           "Допускаемая\\nпогрешность#100;"
                                                                                                           "Диапазоны допускаемых\\nзначений, мкс#150")




OperFreqError("25",  "40 000,00", "±0,02", "39992,00", "40008,00", "Измерение 1$1") #hesh Измерение 1$1:25     ;40 000,00   ;±0,02   ;39992,00   ;40008,00
OperFreqError("0^2", "10 000,00", "±0,02", "9998,00",  "10002,00", "Измерение 2$2") #hesh Измерение 2$2:10^2   ;10 000,00   ;±0,02   ;9998,00    ;10002,00
OperFreqError("10^3","1 000,00",  "±0,02", "999,80",   "1000,20",  "Измерение 3$3") #hesh Измерение 3$3:10^3   ;1 000,00    ;±0,02   ;999,80     ;1000,20
OperFreqError("10^4","100,000",   "±0,02", "99,980",   "100,020",  "Измерение 4$4") #hesh Измерение 4$4:10^4   ;100,000     ;±0,02   ;99,980     ;100,020
OperFreqError("10^5","10,0000",   "±0,02", "9,9980",   "10,0020",  "Измерение 5$5") #hesh Измерение 5$5:10^5   ;10,0000     ;±0,02   ;9,9980     ;10,0020
OperFreqError("10^6","1,00000",   "±0,02", "0,99980",  "1,00020",  "Измерение 6$6") #hesh Измерение 6$6:10^6   ;1,00000     ;±0,02   ;0,99980    ;1,00020




MOKO.Program('tree', 'set', 'chosen=passed')


#EndRegion Определение погрешности \nустановки рабочей частоты

##########################################################################################################

#Region Определение основной \nпогрешности измерения \nпараметров Rp, Rs
#description: Номинальное\nзначение;Предел\nизмерений |Z|;Измеряемый\nпараметр;Рабочая\nчастота, Гц\n;Допускаемая\nпогрешность, %;Нижний\nпредел;Верхний\nпредел


MOKO.Report("Определение основной \\nпогрешности измерения \\nпараметров Rp, Rs", "info", "table", "Номинальное\\nзначение#100;"
                                                                                                                         "Предел\\nизмерения |Z|#120;"
                                                                                                                         "Измеряемый\\nпараметр#100;"
                                                                                                                         "Рабочая\\nчастота, Гц#100;"
                                                                                                                         "Резльтат\\nизмерения#100;" 
                                                                                                                         "Допускаемая\\nпогрешность#100;" 
                                                                                                                         "Диапазоны допускаемых\\nзначений#150")

MOKO.Program('tree', 'set', f'select = Определение основной \\nпогрешности измерения \\nпараметров Rp, Rs')

RpRsError( "10 МОм",  "10 МОм", "Rp", "25", "±0,8", "9920,0 кОм", "10,080 МОм", "Измерение 1$7") #hesh Измерение 1$7     :10 МОм    ;10 МОм    ;Rp   ;  25   ;±0,8    ;9920,0 кОм   ;10,080 МОм
#hesh Измерение 2$2     :10 МОм    ;10 МОм    ;Rp   ;10^2   ;±0,40   ;9960,0 кОм   ;10,040 МОм
#hesh Измерение 3$3     :10 МОм    ;10 МОм    ;Rp   ;10^3   ;±0,32   ;9968,0 кОм   ;10,032 МОм



#hesh Измерение 4$4     :1 МОм     ;10 МОм    ;Rp   ;25     ;±0,8    ;992,00 кОм   ;1008,0 кОм
#hesh Измерение 5$5     :1 МОм     ;10 МОм    ;Rp   ;10^2   ;±0,40   ;996,00 кОм   ;1004,0 кОм
#hesh Измерение 6$6     :1 МОм     ;10 МОм    ;Rp   ;10^3   ;±0,32   ;996,80 кОм   ;1003,2 кОм

#hesh Измерение 7$7     :1 МОм     ;1 МОм     ;Rp   ;25     ;±0,8    ;992,00 кОм   ;1008,0 кОм
#hesh Измерение 8$8     :1 МОм     ;1 МОм     ;Rp   ;10^2   ;±0,24   ;997,60 кОм   ;1002,4 кОм
#hesh Измерение 9$9     :1 МОм     ;1 МОм     ;Rp   ;10^3   ;±0,16   ;998,40 кОм   ;1001,6 кОм
#hesh Измерение 10$10   :1 МОм     ;1 МОм     ;Rp   ;10^4   ;±0,4    ;996,00 кОм   ;1004,0 кОм



#hesh Измерение 11$11   :100 кОм   ;1 МОм     ;Rp   ;25     ;±0,8    ;99,200 кОм   ;100,80 кОм
#hesh Измерение 12$12   :100 кОм   ;1 МОм     ;Rp   ;10^2   ;±0,24   ;99,760 кОм   ;100,24 кОм
#hesh Измерение 13$13   :100 кОм   ;1 МОм     ;Rp   ;10^3   ;±0,16   ;99,840 кОм   ;100,16 кОм
#hesh Измерение 14$14   :100 кОм   ;1 МОм     ;Rp   ;10^4   ;±0,4    ;99,600 кОм   ;100,40 кОм

#hesh Измерение 15$15   :100 кОм   ;100 кОм   ;Rp   ;25     ;±0,4    ;99,600 кОм   ;100,40 кОм
#hesh Измерение 16$16   :100 кОм   ;100 кОм   ;Rp   ;10^2   ;±0,16   ;99,840 кОм   ;100,16 кОм
#hesh Измерение 17$17   :100 кОм   ;100 кОм   ;Rp   ;10^3   ;±0,08   ;99,920 кОм   ;100,08 кОм
#hesh Измерение 18$18   :100 кОм   ;100 кОм   ;Rp   ;10^4   ;±0,16   ;99,840 кОм   ;100,16 кОм
#hesh Измерение 19$19   :100 кОм   ;100 кОм   ;Rp   ;10^5   ;±0,72   ;99,280 кОм   ;100,72 кОм



#hesh Измерение 20$20   :10 кОм    ;100 кОм   ;Rp   ;25     ;±0,4    ;9960,0 Ом    ;10,040 кОм
#hesh Измерение 21$21   :10 кОм    ;100 кОм   ;Rp   ;10^2   ;±0,16   ;9984,0 Ом    ;10,016 кОм
#hesh Измерение 22$22   :10 кОм    ;100 кОм   ;Rp   ;10^3   ;±0,08   ;9992,0 Ом    ;10,008 кОм
#hesh Измерение 23$23   :10 кОм    ;100 кОм   ;Rp   ;10^4   ;±0,16   ;9984,0 Ом    ;10,016 кОм
#hesh Измерение 24$24   :10 кОм    ;100 кОм   ;Rp   ;10^5   ;±0,72   ;9928,0 Ом    ;10,072 кОм

#hesh Измерение 25$25   :10 кОм    ;10 кОм    ;Rp   ;25     ;±0,4    ;9960,0 Ом    ;10,040 кОм
#hesh Измерение 26$26   :10 кОм    ;10 кОм    ;Rp   ;10^2   ;±0,16   ;9984,0 Ом    ;10,016 кОм
#hesh Измерение 27$27   :10 кОм    ;10 кОм    ;Rp   ;10^3   ;±0,08   ;9992,0 Ом    ;10,008 кОм
#hesh Измерение 28$28   :10 кОм    ;10 кОм    ;Rp   ;10^4   ;±0,16   ;9984,0 Ом    ;10,016 кОм
#hesh Измерение 29$29   :10 кОм    ;10 кОм    ;Rp   ;10^5   ;±0,4    ;9960,0 Ом    ;10,040 кОм
#hesh Измерение 30$30   :10 кОм    ;10 кОм    ;Rp   ;10^6   ;±1,6    ;9840,0 Ом    ;10,160 кОм



#hesh Измерение 30$30   :1 кОм     ;10 кОм    ;Rp   ;25     ;±0,4    ;996,00 Ом    ;1004,0 Ом
#hesh Измерение 31$31   :1 кОм     ;10 кОм    ;Rp   ;10^2   ;±0,16   ;998,40 Ом    ;1001,6 Ом
#hesh Измерение 32$32   :1 кОм     ;10 кОм    ;Rp   ;10^3   ;±0,08   ;999,20 Ом    ;1000,8 Ом
#hesh Измерение 33$33   :1 кОм     ;10 кОм    ;Rp   ;10^4   ;±0,16   ;998,40 Ом    ;1001,6 Ом
#hesh Измерение 34$34   :1 кОм     ;10 кОм    ;Rp   ;10^5   ;±0,4    ;996,00 Ом    ;1004,0 Ом
#hesh Измерение 35$35   :1 кОм     ;10 кОм    ;Rp   ;10^6   ;±1,6    ;984,00 Ом    ;1016,0 Ом

#hesh Измерение 36$36   :1 кОм     ;1 кОм     ;Rp   ;25     ;±0,4    ;996,00 Ом    ;1004,0 Ом
#hesh Измерение 37$37   :1 кОм     ;1 кОм     ;Rp   ;10^2   ;±0,16   ;998,40 Ом    ;1001,6 Ом
#hesh Измерение 38$38   :1 кОм     ;1 кОм     ;Rp   ;10^3   ;±0,08   ;999,20 Ом    ;1000,8 Ом
#hesh Измерение 39$39   :1 кОм     ;1 кОм     ;Rp   ;10^4   ;±0,16   ;998,40 Ом    ;1001,6 Ом
#hesh Измерение 40$40   :1 кОм     ;1 кОм     ;Rp   ;10^5   ;±0,4    ;996,00 Ом    ;1004,0 Ом
#hesh Измерение 41$41   :1 кОм     ;1 кОм     ;Rp   ;10^6   ;±1,6    ;984,00 Ом    ;1016,0 Ом



#hesh Измерение 42$42   :100 Ом    ;1 кОм     ;Rp   ;25     ;±0,4    ;99,600 Ом    ;100,40 Ом
#hesh Измерение 43$43   :100 Ом    ;1 кОм     ;Rp   ;10^2   ;±0,16   ;99,840 Ом    ;100,16 Ом
#hesh Измерение 44$44   :100 Ом    ;1 кОм     ;Rp   ;10^3   ;±0,08   ;99,920 Ом    ;100,08 Ом
#hesh Измерение 45$45   :100 Ом    ;1 кОм     ;Rp   ;10^4   ;±0,16   ;99,840 Ом    ;100,16 Ом
#hesh Измерение 46$46   :100 Ом    ;1 кОм     ;Rp   ;10^5   ;±0,4    ;99,600 Ом    ;100,40 Ом
#hesh Измерение 47$47   :100 Ом    ;1 кОм     ;Rp   ;10^6   ;±1,6    ;98,400 Ом    ;101,60 Ом

#hesh Измерение 48$48   :100 Ом    ;100 Ом    ;Rs   ;25     ;±0,48   ;99,520 Ом    ;100,48 Ом
#hesh Измерение 49$49   :100 Ом    ;100 Ом    ;Rs   ;10^2   ;±0,24   ;99,760 Ом    ;100,24 Ом
#hesh Измерение 50$50   :100 Ом    ;100 Ом    ;Rs   ;10^3   ;±0,16   ;99,840 Ом    ;100,16 Ом
#hesh Измерение 51$51   :100 Ом    ;100 Ом    ;Rs   ;10^4   ;±0,24   ;99,760 Ом    ;100,24 Ом
#hesh Измерение 52$52   :100 Ом    ;100 Ом    ;Rs   ;10^5   ;±0,4    ;99,600 Ом    ;100,40 Ом
#hesh Измерение 53$53   :100 Ом    ;100 Ом    ;Rs   ;10^6   ;±1,6    ;98,400 Ом    ;101,60 Ом



#hesh Измерение 54$54   :10 Ом     ;100 Ом    ;Rs   ;25     ;±0,48   ;9952,0 мОм   ;10,048 Ом
#hesh Измерение 55$55   :10 Ом     ;100 Ом    ;Rs   ;10^2   ;±0,24   ;9976,0 мОм   ;10,024 Ом
#hesh Измерение 56$56   :10 Ом     ;100 Ом    ;Rs   ;10^3   ;±0,16   ;9984,0 мОм   ;10,016 Ом
#hesh Измерение 57$57   :10 Ом     ;100 Ом    ;Rs   ;10^4   ;±0,24   ;9976,0 мОм   ;10,024 Ом
#hesh Измерение 58$58   :10 Ом     ;100 Ом    ;Rs   ;10^5   ;±0,4;   9960,0 мОм    ;10,040 Ом
#hesh Измерение 59$58   :10 Ом     ;100 Ом    ;Rs   ;10^6   ;±1,6;   9840,0 мОм    ;10,160 Ом

#hesh Измерение 60$60   :10 Ом     ;10 Ом     ;Rs   ;25     ;±0,8    ;9920,0 мОм   ;10,080 Ом
#hesh Измерение 61$61   :10 Ом     ;10 Ом     ;Rs   ;10^2   ;±0,4    ;9960,0 мОм   ;10,040 Ом
#hesh Измерение 62$62   :10 Ом     ;10 Ом     ;Rs   ;10^3   ;±0,24   ;9976,0 мОм   ;10,024 Ом
#hesh Измерение 63$63   :10 Ом     ;10 Ом     ;Rs   ;10^4   ;±0,32   ;9968,0 мОм   ;10,032 Ом
#hesh Измерение 64$64   :10 Ом     ;10 Ом     ;Rs   ;10^5   ;±0,64   ;9936,0 мОм   ;10,064 Ом
#hesh Измерение 65$65   :10 Ом     ;10 Ом     ;Rs   ;10^6   ;±2,4    ;9760,0 мОм   ;10,240 Ом



#hesh Измерение 66$66   :1 Ом      ;1  Ом     ;Rs   ;25     ;±0,8    ;992,00 мОм   ;1008,0 мОм
#hesh Измерение 67$67   :1 Ом      ;1  Ом     ;Rs   ;10^2   ;±0,4    ;996,00 мОм   ;1004,0 мОм
#hesh Измерение 68$68   :1 Ом      ;1  Ом     ;Rs   ;10^3   ;±0,24   ;997,60 мОм   ;1002,4 мОм
#hesh Измерение 69$69   :1 Ом      ;1  Ом     ;Rs   ;10^4   ;±0,32   ;996,80 мОм   ;1003,2 мОм
#hesh Измерение 70$70   :1 Ом      ;1  Ом     ;Rs   ;10^5   ;±0,64   ;993,60 мОм   ;1006,4 мОм

#hesh Измерение 71$71   :1 Ом      ;10 Ом     ;Rs   ;25     ;±0,8    ;992,00 мОм   ;1008,0 мОм
#hesh Измерение 72$72   :1 Ом      ;10 Ом     ;Rs   ;10^2   ;±0,56   ;994,40 мОм   ;1005,6 мОм
#hesh Измерение 73$73   :1 Ом      ;10 Ом     ;Rs   ;10^3   ;±0,32   ;996,80 мОм   ;1003,2 мОм
#hesh Измерение 74$74   :1 Ом      ;10 Ом     ;Rs   ;10^4   ;±0,32   ;996,80 мОм   ;1003,2 мОм
#hesh Измерение 75$75   :1 Ом      ;10 Ом     ;Rs   ;10^5   ;±0,72   ;992,80 мОм   ;1007,2 мОм


MOKO.Program('tree', 'set', f'select = Измерение')



MOKO.Program('tree', 'set', 'chosen=passed')

#EndRegion Определение основной \nпогрешности измерения \nпараметров Rp, Rs

##########################################################################################################



#Region Определение основной \nпогрешности измерения \nпараметров Cp
#description: Номинальное\nзначение;Предел\nизмерений |Z|;Измеряемый\nпараметр;Рабочая\nчастота, Гц\n;Допускаемая\nпогрешность, %;Нижний\nпредел;Верхний\nпредел

MOKO.Program('tree', 'set', f'select = Определение основной \\nпогрешности измерения \\nпараметров Cp')

#hesh Измерение 1$1   :20 пФ    ;10 МОм    ;Ср   ;10^3   ;±0,32   ;19,936 пФ   ;20,064 пФ
#hesh Измерение 2$2   :100 пФ   ;10 МОм    ;Ср   ;10^3   ;±0,32   ;99,680 пФ   ;100,32 пФ
#hesh Измерение 3$3   :1 нФ     ;1 МОм     ;Ср   ;10^3   ;±0,16   ;998,40 пФ   ;1001,6 пФ
#hesh Измерение 4$4   :10 нФ    ;100 кОм   ;Ср   ;10^3   ;±0,08   ;9,9920 нФ   ;10,008 нФ
#hesh Измерение 5$5   :100 нФ   ;10 кОм    ;Ср   ;10^3   ;±0,08   ;99,920 нФ   ;100,08 нФ


MOKO.Program('tree', 'set', f'select = Измерение')



MOKO.Program('tree', 'set', 'chosen=passed')

#EndRegion Определение основной \nпогрешности измерения \nпараметров Cp


##########################################################################################################


#Region Определение основной \nпогрешности измерения \nпараметров Ls
#description: Номинальное\nзначение;Предел\nизмерений |Z|;Измеряемый\nпараметр;Рабочая\nчастота, Гц\n;Допускаемая\nпогрешность, %;Нижний\nпредел;Верхний\nпредел

MOKO.Program('tree', 'set', f'select = Определение основной \\nпогрешности измерения \\nпараметров Ls')

#hesh Измерение 1$1   :100 мкГн   ;1 Ом     ;Ls   ;10^3   ;±0,32   ;99,680 мкГн   ;100,32 мкГн
#hesh Измерение 2$2   :1 мГн      ;10 Ом    ;Ls   ;10^3   ;±0,24   ;997,60 мкГн   ;1002,4 мкГн
#hesh Измерение 3$3   :10 мГн     ;100 Ом   ;Ls   ;10^3   ;±0,16   ;9984,0 мкГн   ;10,.16 мГн
#hesh Измерение 4$4   :100 мГн    ;1 кОм    ;Ls   ;10^3   ;±0,08   ;99,920 мГн    ;100,08 мГн
#hesh Измерение 5$5   :1 Гн       ;10 кОм   ;Ls   ;10^3   ;±0,08   ;999,20 мГн    ;1000,8 мГн

MOKO.Program('tree', 'set', f'select = Измерение')



MOKO.Program('tree', 'set', 'chosen=passed')

#EndRegion Определение основной \nпогрешности измерения \nпараметров Ls


##########################################################################################################



#Region Определение основной \nпогрешности измерения \nпараметров D, Q
#description: Номинальное\nзначение;Предел\nизмерений |Z|;Измеряемый\nпараметр;Рабочая\nчастота, Гц;Действительное\nзначение;Допускаемая\nпогрешность;Нижний\nпредел;Верхний\nпредел
MOKO.Program('tree', 'set', f'select = Определение основной \\nпогрешности измерения \\nпараметров D, Q')

#hesh Измерение 1$1   :1 нФ  \n159,16 Ом      ;1 МОм     ;D   ;10^3   ;0,0010   ;±0,0016   ;-0,0006   ;0,0026
#hesh Измерение 2$2   :1 нФ  \n1,5916 кОм     ;1 МОм     ;D   ;10^3   ;0,0100   ;±0,0018   ;0,0082    ;0,0118
#hesh Измерение 3$3   :1 нФ  \n1,5916 кОм     ;1 МОм     ;Q   ;10^3   ;100,0    ;±18 %     ;82        ;118
#hesh Измерение 4$4   :10 нФ  \n1,5916 кОм    ;100 кОм   ;D   ;10^3   ;0,1000   ;±0,0016   ;0,0984    ;0,1016
#hesh Измерение 5$5   :10 нФ  \n1,5916 кОм    ;100 кОм   ;Q   ;10^3   ;10,00    ;±1,6 %    ;9,84      ;10,16
#hesh Измерение 6$6   :100 нФ  \n1,5916 кОм   ;10 кОм    ;D   ;10^3   ;1,000    ;±0,009    ;0,991     ;1,009

MOKO.Program('tree', 'set', f'select = Измерение')


MOKO.Program('tree', 'set', 'chosen=passed')

#EndRegion Определение основной \nпогрешности измерения \nпараметров D, Q

MOKO.EndScript('passed')

