

import MOKO
import random



def OperFreqError(F: str, T: str, error: str, lim_low: str, lim_high: str, hesh_name: str, report_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    lim_low_f = float(lim_low.replace(",", "."))
    lim_high_f = float(lim_high.replace(",", "."))
    result = round(random.uniform(lim_low_f, lim_high_f), 5)
    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение диапазонов установки и погрешности воспроизведения рабочей частоты",
                "set", "table",
                F + ";" +
                T + ";" +
                str(result).replace(".", ",") + ";" +
                error + ";" +
                lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))
    MOKO.Report(report_name, "set", "string", str(result).replace(".", ","))

def RpRsError(NomVal: str, LimTest: str, TestParam: str, F: str, error: str, lim_low: str, lim_high: str, hesh_name: str, report_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    lim_low_num = lim_low.split()[0].replace(",", ".")
    lim_high_num = lim_high.split()[0].replace(",", ".")
    result = round(random.uniform(float(lim_low_num), float(lim_high_num)), 2)
    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение основной погрешности при измерении активного сопротивления",
                "set", "table",
                NomVal + ";" +
                LimTest + ";" +
                TestParam + ";" +
                F + ";" +
                str(result).replace(".", ",") + ";" +
                error + ";" +
                lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))
    MOKO.Report(report_name, "set", "string", str(result).replace(".", ","))

def CapError(NomVal: str, LimTest: str, TestParam: str, F: str, error: str, lim_low: str, lim_high: str, hesh_name: str, report_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    lim_low_num = lim_low.split()[0].replace(",", ".")
    lim_high_num = lim_high.split()[0].replace(",", ".")
    result = round(random.uniform(float(lim_low_num), float(lim_high_num)), 3)
    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение основной погрешности при измерении электрической емкости, индуктивности",
                "set", "table",
                NomVal + ";" +
                LimTest + ";" +
                TestParam + ";" +
                F + ";" +
                str(result).replace(".", ",") + ";" +
                error + ";" +
                lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))
    MOKO.Report(report_name, "set", "string", str(result).replace(".", ","))

def DQError(NomVal: str, LimTest: str, TestParam: str, F: str, ActVal: str, error: str, lim_low: str, lim_high: str, hesh_name: str, report_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    lim_low_num = lim_low.split()[0].replace(",", ".")
    lim_high_num = lim_high.split()[0].replace(",", ".")
    result = round(random.uniform(float(lim_low_num), float(lim_high_num)), 4)
    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение основной погрешности при измерении тангенса угла потерь (фактора потерь), добротности",
                "set", "table",
                NomVal + ";" +
                LimTest + ";" +
                TestParam + ";" +
                F + ";" +
                ActVal + ";" +
                str(result).replace(".", ",") + ";" +
                error + ";" +
                lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))
    MOKO.Report(report_name, "set", "string", str(result).replace(".", ","))



#Region Определение диапазонов установки и погрешности воспроизведения рабочей частоты
#description: Установленная\nчастота, Гц\n;Установленный\nпериод, мкс;Допускаемая\nпогрешность, %;Нижний\nпредел, мкс;Верхний\nпредел, мкс



MOKO.Program('tree', 'set', f'select = Определение диапазонов установки и погрешности воспроизведения рабочей частоты')
MOKO.Report("Определение диапазонов установки и погрешности воспроизведения рабочей частоты", "info", "table", "Установленная\\nчастота, Гц#100;"
                                                                                                                                     "Установленный\\nпериод, мкс#120;"
                                                                                                                                     "Результат\\nизмерения, мкс#110;"
                                                                                                                                     "Допускаемая\\nпогрешность, %#110;"
                                                                                                                                     "Диапазоны допускаемых\\nзначений, мкс#160")

OperFreqError("25",   "40 000,0", "±0,02", "39992,0", "40008,0", "Измерение 1$1", "Измерение_1_1") #hesh Измерение 1$1   :25   ;40 000,0   ;±0,02   ;39992,0   ;40008,0
OperFreqError("10^2", "10 000,0", "±0,02", "9998,0",  "10002,0", "Измерение 2$2", "Измерение_2_2") #hesh Измерение 2$2   :10^2   ;10 000,0   ;±0,02   ;9998,0   ;10002,0
OperFreqError("10^3", "1 000,00", "±0,02", "999,80",  "1000,20", "Измерение 3$3", "Измерение_3_3") #hesh Измерение 3$3   :10^3   ;1 000,00   ;±0,02   ;999,80   ;1000,20
OperFreqError("10^4", "100,000",  "±0,02", "99,980",  "100,020", "Измерение 4$4", "Измерение_4_4") #hesh Измерение 4$4   :10^4   ;100,000   ;±0,02   ;99,980   ;100,020
OperFreqError("10^5", "10,0000",  "±0,02", "9,9980",  "10,0020", "Измерение 5$5", "Измерение_5_5") #hesh Измерение 5$5   :10^5   ;10,0000   ;±0,02   ;9,9980   ;10,0020
OperFreqError("10^6", "1,00000",  "±0,02", "0,99980", "1,00020", "Измерение 6$6", "Измерение_6_6") #hesh Измерение 6$6   :10^6   ;1,00000   ;±0,02   ;0,99980   ;1,00020

MOKO.Program('tree', 'set', 'chosen=passed')

#EndRegion Определение диапазонов установки и погрешности воспроизведения рабочей частоты



#Region Определение основной погрешности при измерении активного сопротивления
#description: Номинальное\nзначение;Предел\nизмерения |Z|;Измеряемый\nпараметр;Рабочая\nчастота, Гц;Результат\nизмерения;Допускаемая\nпогрешность;Диапазоны\nдопускаемых\nзначений

# ===================== 4.2 Rp и Rs =====================

MOKO.Program('tree', 'set', f'select = Определение основной погрешности при измерении активного сопротивления')
MOKO.Report("Определение основной погрешности при измерении активного сопротивления",
            "info", "table",
            "Номинальное\\nзначение#120;"
            "Предел\\nизмерения |Z|#120;"
            "Измеряемый\\nпараметр#90;"
            "Рабочая\\nчастота, Гц#90;"
            "Результат\\nизмерения#90;"
            "Допускаемая\\nпогрешность#100;"
            "Диапазоны допускаемых\\nзначений#190")


RpRsError("10 МОм",   "10 МОм",   "Rp", "10^3", "±1,12 %", "9,888 МОм",  "10,11 МОм",  "Измерение 1$7",  "Измерение_1_7")    #hesh Измерение 1$7   :10 МОм   ;10 МОм   ;Rp   ;10^3  ;±1,12 %   ;9,888 МОм    ;10,11 МОм



RpRsError("1 МОм",    "10 МОм",   "Rp", "25",   "±0,80 %", "992,00 кОм", "1,0080 МОм", "Измерение 2$8",  "Измерение_2_8")    #hesh Измерение 2$8   :1 МОм    ;10 МОм   ;Rp   ;25    ;±0,80 %   ;992,00 кОм   ;1,0080 МОм
RpRsError("1 МОм",    "10 МОм",   "Rp", "10^2", "±0,40 %", "996,00 кОм", "1,0040 МОм", "Измерение 3$9",  "Измерение_3_9")    #hesh Измерение 3$9   :1 МОм    ;10 МОм   ;Rp   ;10^2  ;±0,40 %   ;996,00 кОм   ;1,0040 МОм
RpRsError("1 МОм",    "10 МОм",   "Rp", "10^3", "±0,32 %", "996,80 кОм", "1,0032 МОм", "Измерение 4$10", "Измерение_4_10")   #hesh Измерение 4$10  :1 МОм    ;10 МОм   ;Rp   ;10^3  ;±0,32 %   ;996,80 кОм   ;1,0032 МОм

RpRsError("1 МОм",    "1 МОм",    "Rp", "25",   "±1,52 %", "984,80 кОм", "1,0152 МОм", "Измерение 5$11", "Измерение_5_11")   #hesh Измерение 5$11  :1 МОм    ;1 МОм    ;Rp   ;25    ;±1,52 %   ;984,80 кОм   ;1,0152 МОм
RpRsError("1 МОм",    "1 МОм",    "Rp", "10^2", "±0,46 %", "995,40 кОм", "1,0046 МОм", "Измерение 6$12", "Измерение_6_12")   #hesh Измерение 6$12  :1 МОм    ;1 МОм    ;Rp   ;10^2  ;±0,46 %   ;995,40 кОм   ;1,0046 МОм
RpRsError("1 МОм",    "1 МОм",    "Rp", "10^3", "±0,30 %", "997,00 кОм", "1,0030 МОм", "Измерение 7$13", "Измерение_7_13")   #hesh Измерение 7$13  :1 МОм    ;1 МОм    ;Rp   ;10^3  ;±0,30 %   ;997,00 кОм   ;1,0030 МОм
RpRsError("1 МОм",    "1 МОм",    "Rp", "10^4", "±0,47 %", "995,30 кОм", "1,0047 МОм", "Измерение 8$14", "Измерение_8_14")   #hesh Измерение 8$14  :1 МОм    ;1 МОм    ;Rp   ;10^4  ;±0,47 %   ;995,30 кОм   ;1,0047 МОм



RpRsError("100 кОм",  "1 МОм",    "Rp", "25",   "±0,80 %", "99,200 кОм", "100,80 кОм", "Измерение 9$15",  "Измерение_9_15")  #hesh Измерение 9$15  :100 кОм  ;1 МОм    ;Rp   ;25    ;±0,80 %   ;99,200 кОм   ;100,80 кОм
RpRsError("100 кОм",  "1 МОм",    "Rp", "10^2", "±0,24 %", "99,760 кОм", "100,24 кОм", "Измерение 10$16", "Измерение_10_16") #hesh Измерение 10$16 :100 кОм  ;1 МОм    ;Rp   ;10^2  ;±0,24 %   ;99,760 кОм   ;100,24 кОм
RpRsError("100 кОм",  "1 МОм",    "Rp", "10^3", "±0,16 %", "99,840 кОм", "100,16 кОм", "Измерение 11$17", "Измерение_11_17") #hesh Измерение 11$17 :100 кОм  ;1 МОм    ;Rp   ;10^3  ;±0,16 %   ;99,840 кОм   ;100,16 кОм
RpRsError("100 кОм",  "1 МОм",    "Rp", "10^4", "±0,40 %", "99,600 кОм", "100,40 кОм", "Измерение 12$18", "Измерение_12_18") #hesh Измерение 12$18 :100 кОм  ;1 МОм    ;Rp   ;10^4  ;±0,40 %   ;99,600 кОм   ;100,40 кОм

RpRsError("100 кОм",  "100 кОм",  "Rp", "25",   "±0,76 %", "99,240 кОм", "100,76 кОм", "Измерение 13$19", "Измерение_13_19") #hesh Измерение 13$19 :100 кОм  ;100 кОм  ;Rp   ;25    ;±0,76 %   ;99,240 кОм   ;100,76 кОм
RpRsError("100 кОм",  "100 кОм",  "Rp", "10^2", "±0,30 %", "99,700 кОм", "100,30 кОм", "Измерение 14$20", "Измерение_14_20") #hesh Измерение 14$20 :100 кОм  ;100 кОм  ;Rp   ;10^2  ;±0,30 %   ;99,700 кОм   ;100,30 кОм
RpRsError("100 кОм",  "100 кОм",  "Rp", "10^3", "±0,19 %", "99,810 кОм", "100,19 кОм", "Измерение 15$21", "Измерение_15_21") #hesh Измерение 15$21 :100 кОм  ;100 кОм  ;Rp   ;10^3  ;±0,19 %   ;99,810 кОм   ;100,19 кОм
RpRsError("100 кОм",  "100 кОм",  "Rp", "10^4", "±0,46 %", "99,540 кОм", "100,46 кОм", "Измерение 16$22", "Измерение_16_22") #hesh Измерение 16$22 :100 кОм  ;100 кОм  ;Rp   ;10^4  ;±0,46 %   ;99,540 кОм   ;100,46 кОм
RpRsError("100 кОм",  "100 кОм",  "Rp", "10^5", "±2,24 %", "97,760 кОм", "102,24 кОм", "Измерение 17$23", "Измерение_17_23") #hesh Измерение 17$23 :100 кОм  ;100 кОм  ;Rp   ;10^5  ;±2,24 %   ;97,760 кОм   ;102,24 кОм



RpRsError("10 кОм",   "100 кОм",  "Rp", "25",   "±0,40 %", "9,9600 кОм", "10,040 кОм", "Измерение 18$24", "Измерение_18_24") #hesh Измерение 18$24 :10 кОм   ;100 кОм  ;Rp   ;25    ;±0,40 %   ;9,9600 кОм   ;10,040 кОм
RpRsError("10 кОм",   "100 кОм",  "Rp", "10^2", "±0,16 %", "9,9840 кОм", "10,016 кОм", "Измерение 19$25", "Измерение_19_25") #hesh Измерение 19$25 :10 кОм   ;100 кОм  ;Rp   ;10^2  ;±0,16 %   ;9,9840 кОм   ;10,016 кОм
RpRsError("10 кОм",   "100 кОм",  "Rp", "10^3", "±0,12 %", "9,9880 кОм", "10,012 кОм", "Измерение 20$26", "Измерение_20_26") #hesh Измерение 20$26 :10 кОм   ;100 кОм  ;Rp   ;10^3  ;±0,12 %   ;9,9880 кОм   ;10,012 кОм
RpRsError("10 кОм",   "100 кОм",  "Rp", "10^4", "±0,24 %", "9,9760 кОм", "10,024 кОм", "Измерение 21$27", "Измерение_21_27") #hesh Измерение 21$27 :10 кОм   ;100 кОм  ;Rp   ;10^4  ;±0,24 %   ;9,9760 кОм   ;10,024 кОм
RpRsError("10 кОм",   "100 кОм",  "Rp", "10^5", "±0,80 %", "9,9200 кОм", "10,080 кОм", "Измерение 22$28", "Измерение_22_28") #hesh Измерение 22$28 :10 кОм   ;100 кОм  ;Rp   ;10^5  ;±0,80 %   ;9,9200 кОм   ;10,080 кОм

RpRsError("10 кОм",   "10 кОм",   "Rp", "25",   "±0,76 %", "9,9240 кОм", "10,076 кОм", "Измерение 23$29", "Измерение_23_29") #hesh Измерение 23$29 :10 кОм   ;10 кОм   ;Rp   ;25    ;±0,76 %   ;9,9240 кОм   ;10,076 кОм
RpRsError("10 кОм",   "10 кОм",   "Rp", "10^2", "±0,30 %", "9,9700 кОм", "10,030 кОм", "Измерение 24$30", "Измерение_24_30") #hesh Измерение 24$30 :10 кОм   ;10 кОм   ;Rp   ;10^2  ;±0,30 %   ;9,9700 кОм   ;10,030 кОм
RpRsError("10 кОм",   "10 кОм",   "Rp", "10^3", "±0,19 %", "9,9810 кОм", "10,019 кОм", "Измерение 25$31", "Измерение_25_31") #hesh Измерение 25$31 :10 кОм   ;10 кОм   ;Rp   ;10^3  ;±0,19 %   ;9,9810 кОм   ;10,019 кОм
RpRsError("10 кОм",   "10 кОм",   "Rp", "10^4", "±0,30 %", "9,9700 кОм", "10,030 кОм", "Измерение 26$32", "Измерение_26_32") #hesh Измерение 26$32 :10 кОм   ;10 кОм   ;Rp   ;10^4  ;±0,30 %   ;9,9700 кОм   ;10,030 кОм
RpRsError("10 кОм",   "10 кОм",   "Rp", "10^5", "±0,76 %", "9,9240 кОм", "10,076 кОм", "Измерение 27$33", "Измерение_27_33") #hesh Измерение 27$33 :10 кОм   ;10 кОм   ;Rp   ;10^5  ;±0,76 %   ;9,9240 кОм   ;10,076 кОм
RpRsError("10 кОм",   "10 кОм",   "Rp", "10^6", "±6,00 %", "9,4000 кОм", "10,600 кОм", "Измерение 28$34", "Измерение_28_34") #hesh Измерение 28$34 :10 кОм   ;10 кОм   ;Rp   ;10^6  ;±6,00 %   ;9,4000 кОм   ;10,600 кОм



RpRsError("1 кОм",    "10 кОм",   "Rp", "25",   "±0,40 %", "996,00 Ом",  "1,0040 кОм", "Измерение 29$35", "Измерение_29_35") #hesh Измерение 29$35 :1 кОм    ;10 кОм   ;Rp   ;25    ;±0,40 %   ;996,00 Ом    ;1,0040 кОм
RpRsError("1 кОм",    "10 кОм",   "Rp", "10^2", "±0,16 %", "998,40 Ом",  "1,0016 кОм", "Измерение 30$36", "Измерение_30_36") #hesh Измерение 30$36 :1 кОм    ;10 кОм   ;Rp   ;10^2  ;±0,16 %   ;998,40 Ом    ;1,0016 кОм
RpRsError("1 кОм",    "10 кОм",   "Rp", "10^3", "±0,12 %", "998,80 Ом",  "1,0012 кОм", "Измерение 31$37", "Измерение_31_37") #hesh Измерение 31$37 :1 кОм    ;10 кОм   ;Rp   ;10^3  ;±0,12 %   ;998,80 Ом    ;1,0012 кОм
RpRsError("1 кОм",    "10 кОм",   "Rp", "10^4", "±0,16 %", "998,40 Ом",  "1,0016 кОм", "Измерение 32$38", "Измерение_32_38") #hesh Измерение 32$38 :1 кОм    ;10 кОм   ;Rp   ;10^4  ;±0,16 %   ;998,40 Ом    ;1,0016 кОм
RpRsError("1 кОм",    "10 кОм",   "Rp", "10^5", "±0,40 %", "996,00 Ом",  "1,0040 кОм", "Измерение 33$39", "Измерение_33_39") #hesh Измерение 33$39 :1 кОм    ;10 кОм   ;Rp   ;10^5  ;±0,40 %   ;996,00 Ом    ;1,0040 кОм
RpRsError("1 кОм",    "10 кОм",   "Rp", "10^6", "±2,40 %", "976,00 Ом",  "1,0240 кОм", "Измерение 34$40", "Измерение_34_40") #hesh Измерение 34$40 :1 кОм    ;10 кОм   ;Rp   ;10^6  ;±2,40 %   ;976,00 Ом    ;1,0240 кОм

RpRsError("1 кОм",    "1 кОм",    "Rp", "25",   "±0,76 %", "992,40 Ом",  "1,0076 кОм", "Измерение 35$41", "Измерение_35_41") #hesh Измерение 35$41 :1 кОм    ;1 кОм    ;Rp   ;25    ;±0,76 %   ;992,40 Ом    ;1,0076 кОм
RpRsError("1 кОм",    "1 кОм",    "Rp", "10^2", "±0,30 %", "997,00 Ом",  "1,0030 кОм", "Измерение 36$42", "Измерение_36_42") #hesh Измерение 36$42 :1 кОм    ;1 кОм    ;Rp   ;10^2  ;±0,30 %   ;997,00 Ом    ;1,0030 кОм
RpRsError("1 кОм",    "1 кОм",    "Rp", "10^3", "±0,19 %", "998,10 Ом",  "1,0019 кОм", "Измерение 37$43", "Измерение_37_43") #hesh Измерение 37$43 :1 кОм    ;1 кОм    ;Rp   ;10^3  ;±0,19 %   ;998,10 Ом    ;1,0019 кОм
RpRsError("1 кОм",    "1 кОм",    "Rp", "10^4", "±0,30 %", "997,00 Ом",  "1,0030 кОм", "Измерение 38$44", "Измерение_38_44") #hesh Измерение 38$44 :1 кОм    ;1 кОм    ;Rp   ;10^4  ;±0,30 %   ;997,00 Ом    ;1,0030 кОм
RpRsError("1 кОм",    "1 кОм",    "Rp", "10^5", "±0,76 %", "992,40 Ом",  "1,0076 кОм", "Измерение 39$45", "Измерение_39_45") #hesh Измерение 39$45 :1 кОм    ;1 кОм    ;Rp   ;10^5  ;±0,76 %   ;992,40 Ом    ;1,0076 кОм
RpRsError("1 кОм",    "1 кОм",    "Rp", "10^6", "±4,56 %", "954,40 Ом",  "1,0456 кОм", "Измерение 40$46", "Измерение_40_46") #hesh Измерение 40$46 :1 кОм    ;1 кОм    ;Rp   ;10^6  ;±4,56 %   ;954,40 Ом    ;1,0456 кОм



RpRsError("100 Ом",   "1 кОм",    "Rp", "25",   "±0,40 %", "99,600 Ом",  "100,40 Ом", "Измерение 41$47", "Измерение_41_47")  #hesh Измерение 41$47 :100 Ом   ;1 кОм    ;Rp   ;25    ;±0,40 %   ;99,600 Ом    ;100,40 Ом
RpRsError("100 Ом",   "1 кОм",    "Rp", "10^2", "±0,16 %", "99,840 Ом",  "100,16 Ом", "Измерение 42$48", "Измерение_42_48")  #hesh Измерение 42$48 :100 Ом   ;1 кОм    ;Rp   ;10^2  ;±0,16 %   ;99,840 Ом    ;100,16 Ом
RpRsError("100 Ом",   "1 кОм",    "Rp", "10^3", "±0,12 %", "99,880 Ом",  "100,12 Ом", "Измерение 43$49", "Измерение_43_49")  #hesh Измерение 43$49 :100 Ом   ;1 кОм    ;Rp   ;10^3  ;±0,12 %   ;99,880 Ом    ;100,12 Ом
RpRsError("100 Ом",   "1 кОм",    "Rp", "10^4", "±0,16 %", "99,840 Ом",  "100,16 Ом", "Измерение 44$50", "Измерение_44_50")  #hesh Измерение 44$50 :100 Ом   ;1 кОм    ;Rp   ;10^4  ;±0,16 %   ;99,840 Ом    ;100,16 Ом
RpRsError("100 Ом",   "1 кОм",    "Rp", "10^5", "±0,40 %", "99,600 Ом",  "100,40 Ом", "Измерение 45$51", "Измерение_45_51")  #hesh Измерение 45$51 :100 Ом   ;1 кОм    ;Rp   ;10^5  ;±0,40 %   ;99,600 Ом    ;100,40 Ом
RpRsError("100 Ом",   "1 кОм",    "Rp", "10^6", "±2,40 %", "97,600 Ом",  "102,40 Ом", "Измерение 46$52", "Измерение_46_52")  #hesh Измерение 46$52 :100 Ом   ;1 кОм    ;Rp   ;10^6  ;±2,40 %   ;97,600 Ом    ;102,40 Ом

RpRsError("100 Ом",   "100 Ом",   "Rs", "25",   "±0,40 %", "99,520 Ом",  "100,48 Ом", "Измерение 47$53", "Измерение_47_53")  #hesh Измерение 47$53 :100 Ом   ;100 Ом   ;Rs   ;25    ;±0,40 %   ;99,520 Ом    ;100,48 Ом
RpRsError("100 Ом",   "100 Ом",   "Rs", "10^2", "±0,16 %", "99,760 Ом",  "100,24 Ом", "Измерение 48$54", "Измерение_48_54")  #hesh Измерение 48$54 :100 Ом   ;100 Ом   ;Rs   ;10^2  ;±0,16 %   ;99,760 Ом    ;100,24 Ом
RpRsError("100 Ом",   "100 Ом",   "Rs", "10^3", "±0,12 %", "99,880 Ом",  "100,12 Ом", "Измерение 49$55", "Измерение_49_55")  #hesh Измерение 49$55 :100 Ом   ;100 Ом   ;Rs   ;10^3  ;±0,12 %   ;99,880 Ом    ;100,12 Ом
RpRsError("100 Ом",   "100 Ом",   "Rs", "10^4", "±0,16 %", "99,760 Ом",  "100,24 Ом", "Измерение 50$56", "Измерение_50_56")  #hesh Измерение 50$56 :100 Ом   ;100 Ом   ;Rs   ;10^4  ;±0,16 %   ;99,760 Ом    ;100,24 Ом
RpRsError("100 Ом",   "100 Ом",   "Rs", "10^5", "±0,40 %", "99,600 Ом",  "100,40 Ом", "Измерение 51$57", "Измерение_51_57")  #hesh Измерение 51$57 :100 Ом   ;100 Ом   ;Rs   ;10^5  ;±0,40 %   ;99,600 Ом    ;100,40 Ом
RpRsError("100 Ом",   "100 Ом",   "Rs", "10^6", "±2,40 %", "97,600 Ом",  "102,40 Ом", "Измерение 52$58", "Измерение_52_58")  #hesh Измерение 52$58 :100 Ом   ;100 Ом   ;Rs   ;10^6  ;±2,40 %   ;97,600 Ом    ;102,40 Ом



RpRsError("10 Ом",    "100 Ом",   "Rs", "25",   "±0,76 %", "9,9240 Ом",  "10,076 Ом", "Измерение 53$59", "Измерение_53_59")  #hesh Измерение 53$59 :10 Ом    ;100 Ом   ;Rs   ;25    ;±0,76 %   ;9,9240 Ом    ;10,076 Ом
RpRsError("10 Ом",    "100 Ом",   "Rs", "10^2", "±0,30 %", "9,9760 Ом",  "10,030 Ом", "Измерение 54$60", "Измерение_54_60")  #hesh Измерение 54$60 :10 Ом    ;100 Ом   ;Rs   ;10^2  ;±0,30 %   ;9,9760 Ом    ;10,030 Ом
RpRsError("10 Ом",    "100 Ом",   "Rs", "10^3", "±0,19 %", "9,9840 Ом",  "10,019 Ом", "Измерение 55$61", "Измерение_55_61")  #hesh Измерение 55$61 :10 Ом    ;100 Ом   ;Rs   ;10^3  ;±0,19 %   ;9,9840 Ом    ;10,019 Ом
RpRsError("10 Ом",    "100 Ом",   "Rs", "10^4", "±0,30 %", "9,9700 Ом",  "10,030 Ом", "Измерение 56$62", "Измерение_56_62")  #hesh Измерение 56$62 :10 Ом    ;100 Ом   ;Rs   ;10^4  ;±0,30 %   ;9,9700 Ом    ;10,030 Ом
RpRsError("10 Ом",    "100 Ом",   "Rs", "10^5", "±0,76 %", "9,9240 Ом",  "10,076 Ом", "Измерение 57$63", "Измерение_57_63")  #hesh Измерение 57$63 :10 Ом    ;100 Ом   ;Rs   ;10^5  ;±0,76 %   ;9,9240 Ом    ;10,076 Ом
RpRsError("10 Ом",    "100 Ом",   "Rs", "10^6", "±4,56 %", "9,5440 Ом",  "10,456 Ом", "Измерение 58$64", "Измерение_58_64")  #hesh Измерение 58$64 :10 Ом    ;100 Ом   ;Rs   ;10^6  ;±4,56 %   ;9,5440 Ом    ;10,456 Ом

RpRsError("10 Ом",    "10 Ом",    "Rs", "25",   "±0,80 %", "9,9200 Ом",  "10,080 Ом", "Измерение 59$65", "Измерение_59_65")  #hesh Измерение 59$65 :10 Ом    ;10 Ом    ;Rs   ;25    ;±0,80 %   ;9,9200 Ом    ;10,080 Ом
RpRsError("10 Ом",    "10 Ом",    "Rs", "10^2", "±0,24 %", "9,9760 Ом",  "10,024 Ом", "Измерение 60$66", "Измерение_60_66")  #hesh Измерение 60$66 :10 Ом    ;10 Ом    ;Rs   ;10^2  ;±0,24 %   ;9,9760 Ом    ;10,024 Ом
RpRsError("10 Ом",    "10 Ом",    "Rs", "10^3", "±0,24 %", "9,9760 Ом",  "10,024 Ом", "Измерение 61$67", "Измерение_61_67")  #hesh Измерение 61$67 :10 Ом    ;10 Ом    ;Rs   ;10^3  ;±0,24 %   ;9,9760 Ом    ;10,024 Ом
RpRsError("10 Ом",    "10 Ом",    "Rs", "10^4", "±0,24 %", "9,9760 Ом",  "10,024 Ом", "Измерение 62$68", "Измерение_62_68")  #hesh Измерение 62$68 :10 Ом    ;10 Ом    ;Rs   ;10^4  ;±0,24 %   ;9,9760 Ом    ;10,024 Ом
RpRsError("10 Ом",    "10 Ом",    "Rs", "10^5", "±0,80 %", "9,9200 Ом",  "10,080 Ом", "Измерение 63$69", "Измерение_63_69")  #hesh Измерение 63$69 :10 Ом    ;10 Ом    ;Rs   ;10^5  ;±0,80 %   ;9,9200 Ом    ;10,080 Ом
RpRsError("10 Ом",    "10 Ом",    "Rs", "10^6", "±2,40 %", "9,7600 Ом",  "10,240 Ом", "Измерение 64$70", "Измерение_64_70")  #hesh Измерение 64$70 :10 Ом    ;10 Ом    ;Rs   ;10^6  ;±2,40 %   ;9,7600 Ом    ;10,240 Ом



RpRsError("1 Ом",     "10 Ом",    "Rs", "25",   "±1,52 %", "984,80 мОм", "1,0152 Ом", "Измерение 65$71", "Измерение_65_71")  #hesh Измерение 65$71 :1 Ом     ;10 Ом    ;Rs   ;25    ;±1,52 %   ;984,80 мОм   ;1,0152 Ом
RpRsError("1 Ом",     "10 Ом",    "Rs", "10^2", "±0,46 %", "995,40 мОм", "1,0046 Ом", "Измерение 66$72", "Измерение_66_72")  #hesh Измерение 66$72 :1 Ом     ;10 Ом    ;Rs   ;10^2  ;±0,46 %   ;995,40 мОм   ;1,0046 Ом
RpRsError("1 Ом",     "10 Ом",    "Rs", "10^3", "±0,46 %", "995,40 мОм", "1,0046 Ом", "Измерение 67$73", "Измерение_67_73")  #hesh Измерение 67$73 :1 Ом     ;10 Ом    ;Rs   ;10^3  ;±0,46 %   ;995,40 мОм   ;1,0046 Ом
RpRsError("1 Ом",     "10 Ом",    "Rs", "10^4", "±0,46 %", "995,40 мОм", "1,0046 Ом", "Измерение 68$74", "Измерение_68_74")  #hesh Измерение 68$74 :1 Ом     ;10 Ом    ;Rs   ;10^4  ;±0,46 %   ;995,40 мОм   ;1,0046 Ом
RpRsError("1 Ом",     "10 Ом",    "Rs", "10^5", "±1,52 %", "984,80 мОм", "1,0152 Ом", "Измерение 69$75", "Измерение_69_75")  #hesh Измерение 69$75 :1 Ом     ;10 Ом    ;Rs   ;10^5  ;±1,52 %   ;984,80 мОм   ;1,0152 Ом
RpRsError("1 Ом",     "10 Ом",    "Rs", "10^6", "±6,00 %", "940,00 мОм", "1,0600 Ом", "Измерение 70$76", "Измерение_70_76")  #hesh Измерение 70$76 :1 Ом     ;10 Ом    ;Rs   ;10^6  ;±6,00 %   ;940,00 мОм   ;1,0600 Ом

RpRsError("1 Ом",     "1 Ом",     "Rs", "25",   "±0,80 %", "992,00 мОм", "1,0080 Ом", "Измерение 71$77", "Измерение_71_77")  #hesh Измерение 71$77 :1 Ом     ;1 Ом     ;Rs   ;25    ;±0,80 %   ;992,00 мОм   ;1,0080 Ом
RpRsError("1 Ом",     "1 Ом",     "Rs", "10^2", "±0,40 %", "996,00 мОм", "1,0040 Ом", "Измерение 72$78", "Измерение_72_78")  #hesh Измерение 72$78 :1 Ом     ;1 Ом     ;Rs   ;10^2  ;±0,40 %   ;996,00 мОм   ;1,0040 Ом
RpRsError("1 Ом",     "1 Ом",     "Rs", "10^3", "±0,40 %", "996,00 мОм", "1,0040 Ом", "Измерение 73$79", "Измерение_73_79")  #hesh Измерение 73$79 :1 Ом     ;1 Ом     ;Rs   ;10^3  ;±0,40 %   ;996,00 мОм   ;1,0040 Ом
RpRsError("1 Ом",     "1 Ом",     "Rs", "10^4", "±0,40 %", "996,00 мОм", "1,0040 Ом", "Измерение 74$80", "Измерение_74_80")  #hesh Измерение 74$80 :1 Ом     ;1 Ом     ;Rs   ;10^4  ;±0,40 %   ;996,00 мОм   ;1,0040 Ом
RpRsError("1 Ом",     "1 Ом",     "Rs", "10^5", "±0,80 %", "992,00 мОм", "1,0080 Ом", "Измерение 75$81", "Измерение_75_81")  #hesh Измерение 75$81 :1 Ом     ;1 Ом     ;Rs   ;10^5  ;±0,80 %   ;992,00 мОм   ;1,0080 Ом


MOKO.Program('tree', 'set', 'chosen=passed')

#EndRegion Определение основной погрешности при измерении активного сопротивления



#Region Определение основной погрешности при измерении электрической емкости, индуктивности
#description: Номинальное\nзначение;Предел\nизмерения |Z|;Измеряемый\nпараметр;Рабочая\nчастота, Гц;Результат\nизмерения;Допускаемая\nпогрешность;Диапазоны\nдопускаемых\nзначений


MOKO.Program('tree', 'set', f'select = Определение основной погрешности при измерении электрической емкости, индуктивности')
MOKO.Report("Определение основной погрешности при измерении электрической емкости, индуктивности", "info", "table", "Номинальное\\nзначение#120;"
                                                                                                                                           "Предел\\nизмерения |Z|#120;"
                                                                                                                                           "Измеряемый\\nпараметр#80;"
                                                                                                                                           "Рабочая\\nчастота, Гц#90;"
                                                                                                                                           "Результат\\nизмерения#110;"
                                                                                                                                           "Допускаемая\\nпогрешность#120;"
                                                                                                                                           "Диапазоны допускаемых\\nзначений#220")


CapError("20 пФ",    "10 МОм",  "Cp", "10^3", "±0,96 %", "19,808 пФ",   "20,192 пФ",   "Измерение 1$83",  "Измерение_1_83") #hesh Измерение 1$83   :20 пФ    ;10 МОм   ;Cp   ;10^3   ;±0,96 %   ;19,808 пФ   ;20,192 пФ
CapError("100 пФ",   "10 МОм",  "Cp", "10^3", "±0,45 %", "99,550 пФ",   "100,45 пФ",   "Измерение 2$84",  "Измерение_2_84") #hesh Измерение 2$84   :100 пФ   ;10 МОм   ;Cp   ;10^3   ;±0,45 %   ;99,550 пФ   ;100,45 пФ
CapError("1 нФ",     "1 МОм",   "Cp", "10^3", "±0,17 %", "998,30 нФ",   "1001,7 нФ",   "Измерение 3$85",  "Измерение_3_85") #hesh Измерение 3$85   :1 нФ     ;1 МОм    ;Cp   ;10^3   ;±0,17 %   ;998,30 нФ   ;1001,7 нФ
CapError("1 нФ",     "1 МОм",   "Cs", "10^3", "±0,17 %", "998,30 нФ",   "1001,7 нФ",   "Измерение 4$86",  "Измерение_4_86") #hesh Измерение 4$86   :1 нФ     ;1 МОм    ;Cs   ;10^3   ;±0,17 %   ;998,30 нФ   ;1001,7 нФ
CapError("10 нФ",    "100 кОм", "Cp", "10^3", "±0,13 %", "9,9870 нФ",   "10,013 нФ",   "Измерение 5$87",  "Измерение_5_87") #hesh Измерение 5$87   :10 нФ    ;100 кОм  ;Cp   ;10^3   ;±0,13 %   ;9,9870 нФ   ;10,013 нФ
CapError("100 нФ",   "10 кОм",  "Cp", "10^3", "±0,13 %", "99,870 нФ",   "100,13 нФ",   "Измерение 6$88",  "Измерение_6_88") #hesh Измерение 6$88   :100 нФ   ;10 кОм   ;Cp   ;10^3   ;±0,13 %   ;99,870 нФ   ;100,13 нФ

CapError("100 мкГн", "1 Ом",    "Ls", "10^3", "±0,54 %", "99,460 мкГн", "100,54 мкГн", "Измерение 7$89",  "Измерение_7_89") #hesh Измерение 7$89   :100 мкГн ;1 Ом     ;Ls   ;10^3   ;±0,54 %   ;99,460 мкГн ;100,54 мкГн
CapError("1 мГн",    "10 Ом",   "Ls", "10^3", "±0,30 %", "997,00 мкГн", "1,0030 мГн",  "Измерение 8$90",  "Измерение_8_90") #hesh Измерение 8$90   :1 мГн    ;10 Ом    ;Ls   ;10^3   ;±0,30 %   ;997,00 мкГн ;1,0030 мГн
CapError("10 мГн",   "100 Ом",  "Ls", "10^3", "±0,14 %", "9,9860 мГн",  "10,014 мГн",  "Измерение 9$91",  "Измерение_9_91") #hesh Измерение 9$91   :10 мГн   ;100 Ом   ;Ls   ;10^3   ;±0,14 %   ;9,9860 мГн  ;10,014 мГн
CapError("100 мГн",  "1 кОм",   "Ls", "10^3", "±0,16 %", "99,840 мГн",  "100,16 мГн",  "Измерение 10$92", "Измерение_10_92") #hesh Измерение 10$92 :100 мГн  ;1 кОм    ;Ls   ;10^3   ;±0,16 %   ;99,840 мГн  ;100,16 мГн
CapError("1 Гн",     "10 кОм",  "Ls", "10^3", "±0,16 %", "998,40 мГн",  "1,0016 Гн",   "Измерение 11$93", "Измерение_11_93") #hesh Измерение 11$93 :1 Гн     ;10 кОм   ;Ls   ;10^3   ;±0,16 %   ;998,40 мГн  ;1,0016 Гн

MOKO.Program('tree', 'set', 'chosen=passed')

#EndRegion Определение основной погрешности при измерении электрической емкости, индуктивности




#Region Определение основной погрешности при измерении тангенса угла потерь (фактора потерь), добротности
#description: Номинальное\nзначение;Предел\nизмерения |Z|;Измеряемый\nпараметр;Рабочая\nчастота, Гц;Действительное\nзначение;Результат\nизмерения;Допускаемая\nпогрешность;Диапазоны\nдопускаемых\nзначений



MOKO.Program('tree', 'set', f'select = Определение основной погрешности при измерении тангенса угла потерь (фактора потерь), добротности')
MOKO.Report("Определение основной погрешности при измерении тангенса угла потерь (фактора потерь), добротности",
            "info", "table",
            "Номинальное\\nзначение#200;"
            "Предел\\nизмерения |Z|#100;"
            "Измеряемый\\nпараметр#80;"
            "Рабочая\\nчастота, Гц#90;"
            "Действительное\\nзначение#120;"
            "Результат\\nизмерения#110;"
            "Допускаемая\\nпогрешность#120;"
            "Диапазоны допускаемых\\nзначений#200")


DQError("R=1,6 МОм ±1%\\nC=10 нФ (P597)",    "100 кОм", "tg δ (D)", "10^3", "0,01",   "±0,0014",  "0,0086", "0,0114", "Измерение 1$94", "Измерение_1_94") #hesh Измерение 1$94   :R=1,6 МОм ±1%    \nC=10 нФ (P597)   ;100 кОм   ;tg δ (D)   ;10^3   ;0,01    ;±0,0014   ;0,0086   ;0,0114
DQError("R=160 кОм ±0,25%\\nC=10 нФ (P597)", "100 кОм", "Q",        "10^3", "10,053", "±2,48 %",  "9,8037", "10,302", "Измерение 2$95", "Измерение_2_95") #hesh Измерение 2$95   :R=160 кОм ±0,25% \nC=10 нФ (P597)   ;100 кОм   ;Q          ;10^3   ;10,053  ;±2,48 %   ;9,8037   ;10,302
DQError("R=16 кОм ±0,25%\\nC=10 нФ (P597)",  "100 кОм", "tg δ (D)", "10^3", "0,9947", "±0,00133", "0,9934", "0,9960", "Измерение 3$96", "Измерение_3_96") #hesh Измерение 3$96   :R=16 кОм ±0,25%  \nC=10 нФ (P597)   ;100 кОм   ;tg δ (D)   ;10^3   ;0,9947  ;±0,00133  ;0,9934   ;0,9960

MOKO.Program('tree', 'set', 'chosen=passed')

#EndRegion Определение основной погрешности при измерении тангенса угла потерь (фактора потерь), добротности

MOKO.EndScript('passed')
