import MOKO
import MOSC
import MGPH
from MFRT import *
import random
from datetime import datetime
import time


#Region Определение погрешности \nустановки рабочей частоты
#description: Установленная\nчастота, Гц\n;Установленный\nпериод, мкс;Допускаемая\nпогрешность, %;Нижний\nпредел, мкс;Верхний\nпредел, мкс

MOKO.Program('tree', 'set', f'select = Определение погрешности \\nустановки рабочей частоты')
#hesh Измерение 1$1: 25;40 000,00;±0,02;39992,00;40008,00
#hesh Измерение 2$2: 10^2;10 000,00;±0,02;9998,00;10002,00
#hesh Измерение 3$3: 10^3;1 000,00;±0,02;999,80;1000,20
#hesh Измерение 4$4: 10^4;100,000;±0,02;99,980;100,020
#hesh Измерение 5$5: 10^5;10,0000;±0,02;9,9980;10,0020
#hesh Измерение 6$6: 10^6;1,00000;±0,02;0,99980;1,00020

MOKO.Program('tree', 'set', f'select = Измерение')


MOKO.Program('tree', 'set', 'chosen=passed')


#EndRegion Определение погрешности \nустановки рабочей частоты

##########################################################################################################

#Region Определение основной \nпогрешности измерения \nпараметров Rp, Rs
#description: Номинальное\nзначение;Предел\nизмерений |Z|;Измеряемый\nпараметр;Рабочая\nчастота, Гц\n;Допускаемая\nпогрешность, %;Нижний\nпредел, мкс;Верхний\nпредел, мкс

MOKO.Program('tree', 'set', f'select = Определение основной \\nпогрешности измерения \\nпараметров Rp, Rs')
#hesh Измерение 1$1:   10 МОм;10 МОм;Rp;25;±0,8;9920,0 кОм;10,080 МОм
#hesh Измерение 2$2:   10 МОм;10 МОм;Rp;10^2;±0,40;9960,0 кОм;10,040 МОм
#hesh Измерение 3$3:   10 МОм;10 МОм;Rp;10^3;±0,32;9968,0 кОм;10,032 МОм


#hesh Измерение 4$4:   1 МОм;10 МОм;Rp;25;±0,8;992,00;1008,0 кОм
#hesh Измерение 5$5:   1 МОм;10 МОм;Rp;10^2;±0,40;996,00;1004,0 кОм
#hesh Измерение 6$6:   1 МОм;10 МОм;Rp;10^3;±0,32;996,80;1003,2 кОм

#hesh Измерение 7$7:   1 МОм;1 МОм;Rp;25;±0,8;992,00;1008,0 кОм
#hesh Измерение 8$8:   1 МОм;1 МОм;Rp;10^2;±0,24;997,60;1002,4 кОм
#hesh Измерение 9$9:   1 МОм;1 МОм;Rp;10^3;±0,16;998,40;1001,6 кОм
#hesh Измерение 10$10: 1 МОм;1 МОм;Rp;10^4;±0,4;996,00;1004,0 кОм


#hesh Измерение 11$11: 100 кОм;10 МОм;Rp;25;±0,8;992,00;1008,0 кОм
#hesh Измерение 12$12: 100 кОм;10 МОм;Rp;10^2;±0,40;996,00;1004,0 кОм
#hesh Измерение 13$13: 100 кОм;10 МОм;Rp;10^3;±0,32;996,80;1003,2 кОм
#hesh Измерение 14$14: 100 кОм;1 МОм;Rp;10^4;±0,4;996,00;1004,0 кОм

#hesh Измерение 15$15: 100 кОм;1 МОм;Rp;25;±0,8;992,00;1008,0 кОм
#hesh Измерение 16$16: 100 кОм;1 МОм;Rp;10^2;±0,24;997,60;1002,4 кОм
#hesh Измерение 17$17: 100 кОм;1 МОм;Rp;10^3;±0,16;998,40;1001,6 кОм
#hesh Измерение 18$18: 100 кОм;1 МОм;Rp;10^4;±0,4;996,00;1004,0 кОм
#hesh Измерение 19$19: 100 кОм;1 МОм;Rp;10^4;±0,4;996,00;1004,0 кОм


MOKO.Program('tree', 'set', f'select = Измерение')



MOKO.Program('tree', 'set', 'chosen=passed')

#EndRegion Определение основной \nпогрешности измерения \nпараметров Rp, Rs

##########################################################################################################



#Region Определение основной \nпогрешности измерения \nпараметров Cp

MOKO.Program('tree', 'set', f'select = Определение основной \\nпогрешности измерения \\nпараметров Cp')
#hesh Измерение
MOKO.Program('tree', 'set', f'select = Измерение')



MOKO.Program('tree', 'set', 'chosen=passed')

#EndRegion Определение основной \nпогрешности измерения \nпараметров Cp


##########################################################################################################


#Region Определение основной \nпогрешности измерения \nпараметров Ls

MOKO.Program('tree', 'set', f'select = Определение основной \\nпогрешности измерения \\nпараметров Ls')
#hesh Измерение
MOKO.Program('tree', 'set', f'select = Измерение')



MOKO.Program('tree', 'set', 'chosen=passed')

#EndRegion Определение основной \nпогрешности измерения \nпараметров Ls


##########################################################################################################



#Region Определение основной \nпогрешности измерения \nпараметров D, Q

MOKO.Program('tree', 'set', f'select = Определение основной \\nпогрешности измерения \\nпараметров D, Q')
#hesh Измерение

MOKO.Program('tree', 'set', f'select = Измерение')


MOKO.Program('tree', 'set', 'chosen=passed')

#EndRegion Определение основной \nпогрешности измерения \nпараметров D, Q

MOKO.EndScript('passed')

