import MOKO
import MOSC
import MGPH
from MFRT import *
import random
from datetime import datetime
import time

def OperFreqError(F:str, T: str, error: str, lim_low:str, lim_high:str, hesh_name: str, report_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    lim_low = lim_low.replace(",", ".")
    lim_low_f = float(lim_low)
    lim_high = lim_high.replace(",", ".")
    lim_high_f = float(lim_high)
    result = random.uniform(lim_low_f, lim_high_f)
    result = round(result, 5)
    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение погрешности установки рабочей частоты", "set", "table", F + ";" +
                                                                                                         T + ";" +
                                                                                                         str(result).replace(".", ",") + ";" +
                                                                                                         error + ";" +
                                                                                                         lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))
    MOKO.Report(report_name, "set", "string", str(result).replace(".", ","))

def DQError(ComMeas: str, TestParam: str, ActVal: str, error: str, lim_low:str, lim_high:str, hesh_name: str, report_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    lim_low_num = lim_low.split()[0]
    lim_low_num = lim_low_num.replace(",", ".")
    lim_low_f = float(lim_low_num)
    lim_high_num = lim_high.split()[0]
    lim_high_num = lim_high_num.replace(",", ".")
    lim_high_f = float(lim_high_num)
    result = random.uniform(lim_low_f, lim_high_f)
    if TestParam in ['D', 'Q']:
        result = round(result, 4)
    else:
        result = round(result, 2)
    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение основной погрешности прибора (название)", "set", "table",  ComMeas + ";" +
                                                                                              TestParam + ";" +
                                                                                              ActVal + ";" +
                                                                                              str(result).replace(".", ",") + ";" +
                                                                                              error + ";" +
                                                                                              lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))
    MOKO.Report(report_name, "set", "string", str(result).replace(".", ","))

def ParamError(Freq: str, Level: str, Range: str, Param: str, NomVal: str, error: str, lim_low:str, lim_high:str, hesh_name: str, report_name: str):
    MOKO.Program('tree', 'set', f'select = {hesh_name}')
    if "(" in lim_low:
        lim_low = lim_low.replace("(", "").replace(")", "")
        lim_high = lim_high.replace("(", "").replace(")", "")
    lim_low_num = lim_low.split()[0]
    lim_low_num = lim_low_num.replace(",", ".")
    lim_low_f = float(lim_low_num)
    lim_high_num = lim_high.split()[0]
    lim_high_num = lim_high_num.replace(",", ".")
    lim_high_f = float(lim_high_num)
    result = random.uniform(lim_low_f, lim_high_f)
    if Param in ['Gр', 'Cp', 'Ls', 'Rs']:
        if 'мк' in NomVal or 'н' in NomVal or 'п' in NomVal:
            result = round(result, 2)
        else:
            result = round(result, 1)
    elif Param in ['D', 'Q']:
        result = round(result, 4)
    else:
        result = round(result, 2)
    MOKO.Program('tree', 'set', 'chosen=passed')
    MOKO.Report("Определение основной погрешности прибора (Таблица 3)", "set", "table",    Freq + ";" +
                                                                                                                      Level + ";" +
                                                                                                                      Range + ";" +
                                                                                                                      Param + ";" +
                                                                                                                      NomVal + ";" +
                                                                                                                      str(result).replace(".", ",") + ";" +
                                                                                                                      error + ";" +
                                                                                                                      lim_low.replace(".", ",") + " - " + lim_high.replace(".", ","))
    MOKO.Report(report_name, "set", "string", str(result).replace(".", ","))

#Region Определение погрешности установки рабочей частоты
#description: Установленная\nчастота, Гц\n;Установленный\nпериод, мкс;Допускаемая\nпогрешность, %;Нижний\nпредел, мкс;Верхний\nпредел, мкс

MOKO.Program('tree', 'set', f'select = Определение погрешности установки рабочей частоты')
MOKO.Report("Определение погрешности установки рабочей частоты", "info", "table", "Установленная\\nчастота#100;"
                                                                                                           "Установленный\\nпериод#120;"
                                                                                                           "Измеренное\\nзначение, мкс#100;"
                                                                                                           "Допускаемая\\nпогрешность#100;"
                                                                                                           "Диапазоны допускаемых\\nзначений, мкс#150")

OperFreqError("10^2", "10 000", "±0,02", "9998,00", "10002,00", "Измерение 1$1", "Измерение_1_1") #hesh Измерение 1$1 :10^2 ;10 000 ;±0,02  ;9998,00  ;10002,00
OperFreqError("10^3", "1 000",  "±0,02", "999,80",  "1000,20",  "Измерение 2$2", "Измерение_2_2") #hesh Измерение 2$2 :10^3 ;1 000  ;±0,02  ;999,80   ;1000,20

MOKO.Program('tree', 'set', 'chosen=passed')
#EndRegion Определение погрешности установки рабочей частоты



#Region Определение основной погрешности прибора (название прибора)
#description: Составная мера\nпо ГОСТ 8.294-85;Измеряемый\nпараметр;Действительное\nзначение;Допускаемая\nпогрешность, %;Нижний\nпредел;Верхний\nпредел

MOKO.Program('tree', 'set', f'select = Определение основной погрешности прибора')
MOKO.Report("Определение основной погрешности прибора (название)", "info", "table", "Составная мера#200;"
                                                                                                                         "Измеряемый\\nпараметр#100;"
                                                                                                                         "Действительное\\nзначение#100;"
                                                                                                                         "Результат\\nизмерения#100;"
                                                                                                                         "Допускаемая\\nпогрешность#100;"
                                                                                                                         "Диапазоны допускаемых\\nзначений#150")

DQError("R = 1,6 МОм ± 1 % С = 10 нФ (Р597)",    "D",  "0,010", "±0,003", "0,007", "0,013",  "Измерение 1$3", "Измерение_1_3") #hesh Измерение 1$3  :R=1,6МОм ± 1% \nС = 10 нФ (Р597)     ;D  ;0,010  ;±0,003  ;0,007  ;0,013
DQError("R = 160 кОм ± 0,25% С = 10 нФ (Р597)",  "Q",  "10,05", "±3,4 %", "9,708", "10,391", "Измерение 2$4", "Измерение_2_4") #hesh Измерение 2$4  :R=160кОм ± 0,25% \nС = 10 нФ (Р597)  ;Q  ;10,05  ;±3,4 %  ;9,708  ;10,391
DQError("R =16 кОм ± 0,25% С = 10 нФ (Р597)",    "D",  "0,995", "±0,007", "0,988", "1,002",  "Измерение 3$5", "Измерение_3_5") #hesh Измерение 3$5  :R=16кОм ± 0,25% \nС = 10 нФ (Р597)   ;D  ;0,995  ;±0,007  ;0,988  ;1,002

MOKO.Program('tree', 'set', 'chosen=passed')
#EndRegion Определение основной погрешности прибора (название прибора)

#Region Определение основной погрешности прибора (Таблица 3)
#description: Рабочая\nчастота, кГц;Уровень\nсигнала, В;Номер\nдиапазона;Измеряемый\nпараметр;Номинальное\nзначение\nизмеряемой\nвеличины;Допускаемая\nпогрешность;Нижний\nпредел;Верхний\nпредел

MOKO.Program('tree', 'set', f'select = Определение основной погрешности прибора (Таблица 3)')
MOKO.Report("Определение основной погрешности прибора (Таблица 3)", "info", "table", "Рабочая\\nчастота, кГц#80;"
                                                                                                                         "Уровень\\nсигнала, В#80;"
                                                                                                                         "Номер\\nдиапазона#80;"
                                                                                                                         "Измеряемый\\nпараметр#80;"
                                                                                                                         "Номинальное\\nзначение\\nизмеряемой\\nвеличины#120;"
                                                                                                                         "Результат\\nизмерения#100;"
                                                                                                                         "Допускаемая\\nпогрешность#100;"
                                                                                                                         "Диапазоны допускаемых\\nзначений#150")

# Частота 0,1 кГц, Уровень 1 В
ParamError("0,1", "1",   "1", "Gр", "0 нСм (ХХ)",   "±1,6 нСм",  "(-1,6) нСм",   "1,6 нСм",     "Измерение 1$6",   "Измерение_1_6")   #hesh Измерение 1$6    :0,1  ;1  ;1   ;Gр  ;0 нСм (ХХ)  ;±1,6 нСм  ;(-1,6) нСм   ;1,6 нСм
ParamError("0,1", "1",   "1", "Ср", "0 пФ (ХХ)",    "±2,6 пФ",   "(-2,6) пФ",    "2,6 пФ",      "Измерение 2$7",   "Измерение_2_7")   #hesh Измерение 2$7    :0,1  ;1  ;1   ;Ср  ;0 пФ (ХХ)   ;±2,6 пФ   ;(-2,6) пФ    ;2,6 пФ
ParamError("0,1", "1",   "1", "Ср", "200 пФ",       "±1,9 %",    "196,20 пФ",    "203,80 пФ",   "Измерение 3$8",   "Измерение_3_8")   #hesh Измерение 3$8    :0,1  ;1  ;1   ;Ср  ;200 пФ      ;±1,9 %    ;196,20 пФ    ;203,80 пФ
ParamError("0,1", "1",   "1", "D",  "D < 10^-3",    "±0,017",    "(-0,017)",     "0,017",       "Измерение 4$9",   "Измерение_4_9")   #hesh Измерение 4$9    :0,1  ;1  ;1   ;D   ;D < 10^-3   ;±0,017    ;(-0,017)     ;0,017
ParamError("0,1", "1",   "1", "Ср", "1000 пФ",      "±0,90 %",   "991,0 пФ",     "1009,0 пФ",   "Измерение 5$10",  "Измерение_5_10")  #hesh Измерение 5$10   :0,1  ;1  ;1   ;Ср  ;1000 пФ     ;±0,90 %   ;991,0 пФ     ;1009,0 пФ
ParamError("0,1", "1",   "1", "D",  "D < 10^-3",    "±0,0066",   "(-0,007)",     "0,007",       "Измерение 6$11",  "Измерение_6_11")  #hesh Измерение 6$11   :0,1  ;1  ;1   ;D   ;D < 10^-3   ;±0,0066   ;(-0,007)     ;0,007

ParamError("0,1", "1",   "2", "Ср", "2 нФ",         "±0,18 %",   "1,9964 нФ",    "2,0036 нФ",   "Измерение 7$12",  "Измерение_7_12")  #hesh Измерение 7$12   :0,1  ;1  ;2   ;Ср  ;2 нФ        ;±0,18 %   ;1,9964 нФ    ;2,0036 нФ
ParamError("0,1", "1",   "2", "D",  "D < 10^-3",    "±0,0084",   "(-0,008)",     "0,008",       "Измерение 8$13",  "Измерение_8_13")  #hesh Измерение 8$13   :0,1  ;1  ;2   ;D   ;D < 10^-3   ;±0,0084   ;(-0,008)     ;0,008
ParamError("0,1", "1",   "2", "Ср", "10 нФ",        "±0,13 %",   "9,987 нФ",     "10,013 нФ",   "Измерение 9$14",  "Измерение_9_14")  #hesh Измерение 9$14   :0,1  ;1  ;2   ;Ср  ;10 нФ       ;±0,13 %   ;9,987 нФ     ;10,013 нФ
ParamError("0,1", "1",   "2", "D",  "D < 10^-3",    "±0,0033",   "(-0,003)",     "0,003",       "Измерение 10$15", "Измерение_10_15") #hesh Измерение 10$15  :0,1  ;1  ;2   ;D   ;D < 10^-3   ;±0,0033   ;(-0,003)     ;0,003

ParamError("0,1", "1",   "3", "Ср", "20 нФ",        "±0,18 %",   "19,964 нФ",    "20,036 нФ",   "Измерение 11$16", "Измерение_11_16") #hesh Измерение 11$16  :0,1  ;1  ;3   ;Ср  ;20 нФ       ;±0,18 %   ;19,964 нФ    ;20,036 нФ
ParamError("0,1", "1",   "3", "D",  "D < 10^-3",    "±0,084",    "(-0,008)",     "0,008",       "Измерение 12$17", "Измерение_12_17") #hesh Измерение 12$17  :0,1  ;1  ;3   ;D   ;D < 10^-3   ;±0,084    ;(-0,008)     ;0,008
ParamError("0,1", "1",   "3", "Ср", "100 нФ",       "±0,13 %",   "99,870 нФ",    "100,13 нФ",   "Измерение 13$18", "Измерение_13_18") #hesh Измерение 13$18  :0,1  ;1  ;3   ;Ср  ;100 нФ      ;±0,13 %   ;99,870 нФ    ;100,13 нФ
ParamError("0,1", "1",   "3", "D",  "D < 10^-3",    "±0,0033",   "(-0,003)",     "0,003",       "Измерение 14$19", "Измерение_14_19") #hesh Измерение 14$19  :0,1  ;1  ;3   ;D   ;D < 10^-3   ;±0,0033   ;(-0,003)     ;0,003

ParamError("0,1", "1",   "4", "Rp", "10 кОм",       "±0,19 %",   "9,981 кОм",    "10,019 кОм",  "Измерение 15$20", "Измерение_15_20") #hesh Измерение 15$20  :0,1  ;1   ;4  ;Rp  ;10 кОм      ;±0,19 %   ;9,981 кОм     ;10,019 кОм
ParamError("0,1", "1",   "4", "Rp", "1 кОм",        "±0,12 %",   "0,9988 кОм",   "1,0012 кОм",  "Измерение 16$21", "Измерение_16_21") #hesh Измерение 16$21  :0,1  ;1   ;4  ;Rp  ;1 кОм       ;±0,12 %   ;0,9988 кОм    ;1,0012 кОм

ParamError("0,1", "1",   "5", "Rs", "1000 Ом",      "±0,12 %",   "998,8 Ом",     "1001,2 Ом",   "Измерение 17$22", "Измерение_17_22") #hesh Измерение 17$22  :0,1  ;1   ;5  ;Rs  ;1000 Ом     ;±0,12 %    ;998,8 Ом     ;1001,2 Ом
ParamError("0,1", "1",   "5", "Rs", "900 Ом",       "±0,12 %",   "898,92 Ом",    "901,08 Ом",   "Измерение 18$23", "Измерение_18_23") #hesh Измерение 18$23  :0,1  ;1   ;5  ;Rs  ;900 Ом      ;±0,12 %    ;898,92 Ом    ;901,08 Ом
ParamError("0,1", "1",   "5", "Rs", "800 Ом",       "±0,12 %",   "799,04 Ом",    "800,96 Ом",   "Измерение 19$24", "Измерение_19_24") #hesh Измерение 19$24  :0,1  ;1   ;5  ;Rs  ;800 Ом      ;±0,12 %    ;799,04 Ом    ;800,96 Ом
ParamError("0,1", "1",   "5", "Rs", "700 Ом",       "±0,12 %",   "699,16 Ом",    "700,84 Ом",   "Измерение 20$25", "Измерение_20_25") #hesh Измерение 20$25  :0,1  ;1   ;5  ;Rs  ;700 Ом      ;±0,12 %    ;699,16 Ом    ;700,84 Ом
ParamError("0,1", "1",   "5", "Rs", "600 Ом",       "±0,13 %",   "599,22 Ом",    "600,78 Ом",   "Измерение 21$26", "Измерение_21_26") #hesh Измерение 21$26  :0,1  ;1   ;5  ;Rs  ;600 Ом      ;±0,13 %    ;599,22 Ом    ;600,78 Ом
ParamError("0,1", "1",   "5", "Rs", "500 Ом",       "±0,13 %",   "499,35 Ом",    "500,65 Ом",   "Измерение 22$27", "Измерение_22_27") #hesh Измерение 22$27  :0,1  ;1   ;5  ;Rs  ;500 Ом      ;±0,13 %    ;499,35 Ом    ;500,65 Ом
ParamError("0,1", "1",   "5", "Rs", "400 Ом",       "±0,14 %",   "399,44 Ом",    "400,56 Ом",   "Измерение 23$28", "Измерение_23_28") #hesh Измерение 23$28  :0,1  ;1   ;5  ;Rs  ;400 Ом      ;±0,14 %    ;399,44 Ом    ;400,56 Ом
ParamError("0,1", "1",   "5", "Rs", "300 Ом",       "±0,14 %",   "299,58 Ом",    "300,42 Ом",   "Измерение 24$29", "Измерение_24_29") #hesh Измерение 24$29  :0,1  ;1   ;5  ;Rs  ;300 Ом      ;±0,14 %    ;299,58 Ом    ;300,42 Ом
ParamError("0,1", "1",   "5", "Rs", "200 Ом",       "±0,15 %",   "199,70 Ом",    "200,30 Ом",   "Измерение 25$30", "Измерение_25_30") #hesh Измерение 25$30  :0,1  ;1   ;5  ;Rs  ;200 Ом      ;±0,15 %    ;199,70 Ом    ;200,30 Ом
ParamError("0,1", "1",   "5", "Rs", "100 Ом",       "±0,19 %",   "99,81 Ом",     "100,19 Ом",   "Измерение 26$31", "Измерение_26_31") #hesh Измерение 26$31  :0,1  ;1   ;5  ;Rs  ;100 Ом      ;±0,19 %    ;99,81 Ом     ;100,19 Ом

ParamError("0,1", "1",   "8", "Rs", "0 мОм (КЗ)",   "±1,6 мОм",  "(-1,6) мОм",   "1,6 мОм",     "Измерение 27$32", "Измерение_27_32") #hesh Измерение 27$32  :0,1  ;1   ;8  ;Rs  ;0 мОм (КЗ)  ;±1,6 мОм   ;(-1,6) мОм   ;1,6 мОм
ParamError("0,1", "1",   "8", "Ls", "0 мкГн (КЗ)",  "±2,6 мкГн", "(-2,6) мкГн",  "2,6 мкГн",    "Измерение 28$33", "Измерение_28_33") #hesh Измерение 28$33  :0,1  ;1   ;8  ;Ls  ;0 мкГн (КЗ) ;±2,6 мкГн  ;(-2,6) мкГн  ;2,6 мкГн

# Частота 0,1 кГц, Уровень 0,1 В
ParamError("0,1", "0,1", "3", "Ср", "20 нФ",        "±0,53 %",   "19,894 нФ",    "20,106 нФ",   "Измерение 29$34", "Измерение_29_34") #hesh Измерение 29$34  :0,1  ;0,1 ;3  ;Ср  ;20 нФ       ;±0,53 %    ;19,894 нФ    ;20,106 нФ
ParamError("0,1", "0,1", "3", "D",  "D < 10^-3",    "±0,0265",   "(-0,008)",     "0,008",       "Измерение 30$35", "Измерение_30_35") #hesh Измерение 30$35  :0,1  ;0,1 ;3  ;D   ;D < 10^-3   ;±0,0265    ;(-0,008)     ;0,008
ParamError("0,1", "0,1", "3", "Ср", "100 нФ",       "±0,37 %",   "99,63 нФ",     "100,37 нФ",   "Измерение 31$36", "Измерение_31_36") #hesh Измерение 31$36  :0,1  ;0,1 ;3  ;Ср  ;100 нФ      ;±0,37 %    ;99,63 нФ     ;100,37 нФ
ParamError("0,1", "0,1", "3", "D",  "D < 10^-3",    "±0,010",    "(-0,010)",     "0,010",       "Измерение 32$37", "Измерение_32_37") #hesh Измерение 32$37  :0,1  ;0,1 ;3  ;D   ;D < 10^-3   ;±0,010     ;(-0,010)     ;0,010

ParamError("0,1", "0,1", "4", "Rp", "10 кОм",       "±0,58 %",   "9,942 кОм",    "10,058 кОм",  "Измерение 33$38", "Измерение_33_38") #hesh Измерение 33$38  :0,1  ;0,1 ;4  ;Rp  ;10 кОм      ;±0,58 %    ;9,942 кОм    ;10,058 кОм
ParamError("0,1", "0,1", "4", "Rp", "1 кОм",        "±0,36 %",   "0,9964 кОм",   "1,0036 кОм",  "Измерение 34$39", "Измерение_34_39") #hesh Измерение 34$39  :0,1  ;0,1 ;4  ;Rp  ;1 кОм       ;±0,36 %    ;0,9964 кОм   ;1,0036 кОм

ParamError("0,1", "0,1", "5", "Rs", "1 кОм",        "±0,36 %",   "996,4 Ом",     "1003,6 Ом",   "Измерение 35$40", "Измерение_35_40") #hesh Измерение 35$40  :0,1  ;0,1 ;5  ;Rs  ;1 кОм       ;±0,36 %    ;996,4 Ом     ;1003,6 Ом
ParamError("0,1", "0,1", "5", "Rs", "100 Ом",       "±0,58%",    "99,42 Ом",     "100,58 Ом",   "Измерение 36$41", "Измерение_36_41") #hesh Измерение 36$41  :0,1  ;0,1 ;5  ;Rs  ;100 Ом      ;±0,58%     ;99,42 Ом     ;100,58 Ом



# Частота 1 кГц, Уровень 1 В
ParamError("1",   "1",   "1", "Gр", "0 нСм (ХХ)",   "±1,6 нСм",  "(-1,6) нСм",   "1,6 нСм",     "Измерение 37$42", "Измерение_37_42") #hesh Измерение 37$42  :1    ;1   ;1  ;Gр  ;0 нСм (ХХ)  ;±1,6 нСм   ;(-1,6) нСм   ;1,6 нСм
ParamError("1",   "1",   "1", "Cp", "0 пФ (ХХ)",    "±0,26 пФ",  "(-0,26) пФ",   "0,26 пФ",     "Измерение 38$43", "Измерение_38_43") #hesh Измерение 38$43  :1    ;1   ;1  ;Cp  ;0 пФ (ХХ)   ;±0,26 пФ   ;(-0,26) пФ   ;0,26 пФ
ParamError("1",   "1",   "1", "Cp", "20 пФ",        "±1,9 %",    "19,62 пФ",     "20,38 пФ",    "Измерение 39$44", "Измерение_39_44") #hesh Измерение 39$44  :1    ;1   ;1  ;Cp  ;20 пФ       ;±1,9 %     ;19,62 пФ     ;20,38 пФ
ParamError("1",   "1",   "1", "D",  "D < 10^-3",    "±0,017",    "(-0,017)",     "0,017",       "Измерение 40$45", "Измерение_40_45") #hesh Измерение 40$45  :1    ;1   ;1  ;D   ;D < 10^-3   ;±0,017     ;(-0,017)     ;0,017
ParamError("1",   "1",   "1", "Cp", "100 пФ",       "±0,90 %",   "99,10 пФ",     "100,90 пФ",   "Измерение 41$46", "Измерение_41_46") #hesh Измерение 41$46  :1    ;1   ;1  ;Cp  ;100 пФ      ;±0,90 %    ;99,10 пФ     ;100,90 пФ
ParamError("1",   "1",   "1", "D",  "D < 10^-3",    "±0,0066",   "(-0,007)",     "0,007",       "Измерение 42$47", "Измерение_42_47") #hesh Измерение 42$47  :1    ;1   ;1  ;D   ;D < 10^-3   ;±0,0066    ;(-0,007)     ;0,007

ParamError("1",   "1",   "2", "Cp", "200 пФ",       "±0,18 %",   "199,64 пФ",    "200,36 пФ",   "Измерение 43$48", "Измерение_43_48") #hesh Измерение 43$48  :1    ;1   ;2  ;Cp  ;200 пФ      ;±0,18 %    ;199,64 пФ    ;200,36 пФ
ParamError("1",   "1",   "2", "D",  "D < 10^-3",    "±0,0084",   "(-0,008)",     "0,008",       "Измерение 44$49", "Измерение_44_49") #hesh Измерение 44$49  :1    ;1   ;2  ;D   ;D < 10^-3   ;±0,0084    ;(-0,008)     ;0,008
ParamError("1",   "1",   "2", "Cp", "1000 пФ ",     "±0,13 %",   "998,7 пФ",     "1001,3 пФ",   "Измерение 45$50", "Измерение_45_50") #hesh Измерение 45$50  :1    ;1   ;2  ;Cp  ;1000 пФ     ;±0,13 %    ;998,7 пФ     ;1001,3 пФ
ParamError("1",   "1",   "2", "D",  "D < 10^-3",    "±0,0033",   "(-0,003)",     "0,003",       "Измерение 46$51", "Измерение_46_51") #hesh Измерение 46$51  :1    ;1   ;2  ;D   ;D < 10^-3   ;±0,0033    ;(-0,003)     ;0,003

ParamError("1",   "1",   "3", "Cp", "2 нФ",         "±0,18 %",   "1,9964 нФ",    "2,0036 нФ",   "Измерение 47$52", "Измерение_47_52") #hesh Измерение 47$52  :1    ;1   ;3  ;Cp  ;2 нФ        ;±0,18 %    ;1,9964 нФ    ;2,0036
ParamError("1",   "1",   "3", "D",  "D < 10^-3",    "±0,0084",   "(-0,008)",     "0,008",       "Измерение 48$53", "Измерение_48_53") #hesh Измерение 48$53  :1    ;1   ;3  ;D   ;D < 10^-3   ;±0,0084    ;(-0,008)     ;0,008
ParamError("1",   "1",   "3", "Cp", "10 нФ",        "±0,13 %",   "9,987 нФ",     "10,013 нФ",   "Измерение 49$54", "Измерение_49_54") #hesh Измерение 49$54  :1    ;1   ;3  ;Cp  ;10 нФ       ;±0,13 %    ;9,987 нФ     ;10,013 нФ
ParamError("1",   "1",   "3", "D",  "D < 10^-3",    "±0,0033",   "(-0,003)",     "0,003",       "Измерение 50$55", "Измерение_50_55") #hesh Измерение 50$55  :1    ;1   ;3  ;D   ;D < 10^-3   ;±0,0033    ;(-0,003)     ;0,003

ParamError("1",   "1",   "4", "Rp", "10 кОм",       "±0,19 %",   "9,981 кОм",    "10,019 кОм",  "Измерение 51$56", "Измерение_51_56") #hesh Измерение 51$56  :1    ;1   ;4  ;Rp  ;10 кОм      ;±0,19 %    ;9,981 кОм    ;10,019 кОм
ParamError("1",   "1",   "4", "Rp", "1 кОм",        "±0,12 %",   "0,9988 кОм",   "1,0012 кОм",  "Измерение 52$57", "Измерение_52_57") #hesh Измерение 52$57  :1    ;1   ;4  ;Rp  ;1 кОм       ;±0,12 %    ;0,9988 кОм   ;1,0012 кОм

ParamError("1",   "1",   "5", "Rs", "1000 Ом",      "±0,12 %",   "998,8 Ом",     "1001,2 Ом",   "Измерение 53$58", "Измерение_53_58") #hesh Измерение 53$58  :1    ;1   ;5  ;Rs  ;1000 Ом     ;±0,12 %    ;998,8 Ом     ;1001,2 Ом
ParamError("1",   "1",   "5", "Rs", "900 Ом",       "±0,12 %",   "898,92 Ом",    "901,08 Ом",   "Измерение 54$59", "Измерение_54_59") #hesh Измерение 54$59  :1    ;1   ;5  ;Rs  ;900 Ом      ;±0,12 %    ;898,92 Ом    ;901,08 Ом
ParamError("1",   "1",   "5", "Rs", "800 Ом",       "±0,12 %",   "799,04 Ом",    "800,96 Ом",   "Измерение 55$60", "Измерение_55_60") #hesh Измерение 55$60  :1    ;1   ;5  ;Rs  ;800 Ом      ;±0,12 %    ;799,04 Ом    ;800,96 Ом
ParamError("1",   "1",   "5", "Rs", "700 Ом",       "±0,12 %",   "699,16 Ом",    "700,84 Ом",   "Измерение 56$61", "Измерение_56_61") #hesh Измерение 56$61  :1    ;1   ;5  ;Rs  ;700 Ом      ;±0,12 %    ;699,16 Ом    ;700,84 Ом
ParamError("1",   "1",   "5", "Rs", "600 Ом",       "±0,13 %",   "599,22 Ом",    "600,78 Ом",   "Измерение 57$62", "Измерение_57_62") #hesh Измерение 57$62  :1    ;1   ;5  ;Rs  ;600 Ом      ;±0,13 %    ;599,22 Ом    ;600,78 Ом
ParamError("1",   "1",   "5", "Rs", "500 Ом",       "±0,13 %",   "499,35 Ом",    "500,65 Ом",   "Измерение 58$63", "Измерение_58_63") #hesh Измерение 58$63  :1    ;1   ;5  ;Rs  ;500 Ом      ;±0,13 %    ;499,35 Ом    ;500,65 Ом
ParamError("1",   "1",   "5", "Rs", "400 Ом",       "±0,14 %",   "399,44 Ом",    "400,56 Ом",   "Измерение 59$64", "Измерение_59_64") #hesh Измерение 59$64  :1    ;1   ;5  ;Rs  ;400 Ом      ;±0,14 %    ;399,44 Ом    ;400,56 Ом
ParamError("1",   "1",   "5", "Rs", "300 Ом",       "±0,14 %",   "299,58 Ом",    "300,42 Ом",   "Измерение 60$65", "Измерение_60_65") #hesh Измерение 60$65  :1    ;1   ;5  ;Rs  ;300 Ом      ;±0,14 %    ;299,58 Ом    ;300,42 Ом
ParamError("1",   "1",   "5", "Rs", "200 Ом",       "±0,15 %",   "199,70 Ом",    "200,30 Ом",   "Измерение 61$66", "Измерение_61_66") #hesh Измерение 61$66  :1    ;1   ;5  ;Rs  ;200 Ом      ;±0,15 %    ;199,70 Ом    ;200,30 Ом
ParamError("1",   "1",   "5", "Rs", "100 Ом",       "±0,19 %",   "99,81 Ом",     "100,19 Ом",   "Измерение 62$67", "Измерение_62_67") #hesh Измерение 62$67  :1    ;1   ;5  ;Rs  ;100 Ом      ;±0,19 %    ;99,81 Ом     ;100,19 Ом

ParamError("1",   "1",   "6", "Ls", "10 мГн",      "±0,13 %",    "9,987 мГн",    "10,013 мГн",  "Измерение 63$68", "Измерение_63_68") #hesh Измерение 63$68  :1    ;1   ;6  ;Ls  ;10 мГн      ;±0,13 %    ;9,987 мГн    ;10,013 мГн
ParamError("1",   "1",   "6", "Ls", "5 мГн",       "±0,14 %",    "4,9930 мГн",   "5,0070 мГн",  "Измерение 64$69", "Измерение_64_69") #hesh Измерение 64$69  :1    ;1   ;6  ;Ls  ;5 мГн       ;±0,14 %    ;4,9930 мГн   ;5,0070 мГн

ParamError("1",   "1",   "7", "Ls", "1000 мкГн",   "±0,27 %",    "997,3 мкГн",   "1002,7 мкГн", "Измерение 65$70", "Измерение_65_70") #hesh Измерение 65$70  :1    ;1   ;7  ;Ls  ;1000 мкГн   ;±0,27 %    ;997,3 мкГн   ;1002,7 мкГн
ParamError("1",   "1",   "7", "Ls", "500 мкГн",    "±0,35 %",    "498,25 мкГн",  "501,75 мкГн", "Измерение 66$71", "Измерение_66_71") #hesh Измерение 66$71  :1    ;1   ;7  ;Ls  ;500 мкГн    ;±0,35 %    ;498,25 мкГн  ;501,75 мкГн

ParamError("1",   "1",   "8", "Ls", "100 мкГн",    "±0,9 %",     "99,10 мкГн",   "100,90 мкГн", "Измерение 67$72", "Измерение_67_72") #hesh Измерение 67$72  :1    ;1   ;8  ;Ls  ;100 мкГн    ;±0,9 %     ;99,10 мкГн   ;100,90 мкГн
ParamError("1",   "1",   "8", "Ls", "10 мкГн",     "±3,4 %",     "9,66 мкГн",    "10,34 мкГн",  "Измерение 68$73", "Измерение_68_73") #hesh Измерение 68$73  :1    ;1   ;8  ;Ls  ;10 мкГн     ;±3,4 %     ;9,66 мкГн    ;10,34 мкГн
ParamError("1",   "1",   "8", "Rs", "0 мОм (КЗ)",  "±1,6 мОм",   "(-1,6) мОм",   "1,6 мОм",     "Измерение 69$74", "Измерение_69_74") #hesh Измерение 69$74  :1    ;1   ;8  ;Rs  ;0 мОм (КЗ)  ;±1,6 мОм   ;(-1,6) мОм   ;1,6 мОм
ParamError("1",   "1",   "8", "Ls", "0 мкГн (КЗ)", "±0,26 мкГн", "(-0,26) мкГн", "0,26 мкГн",   "Измерение 70$75", "Измерение_70_75") #hesh Измерение 70$75  :1    ;1   ;8  ;Ls  ;0 мкГн (КЗ) ;±0,26 мкГн ;(-0,26) мкГн ;0,26 мкГн

# Частота 1 кГц, Уровень 0,1 В
ParamError("1",   "0,1", "3", "Cp", "2 нФ",        "±0,53 %",    "1,9894 нФ",    "2,0106 нФ",   "Измерение 71$76", "Измерение_71_76") #hesh Измерение 71$76  :1    ;0,1 ;3  ;Cp  ;2 нФ        ;±0,53 %    ;1,9894 нФ    ;2,0106 нФ
ParamError("1",   "0,1", "3", "D",  "D < 10^-3",   "±0,025",     "(-0,025)",     "0,025",       "Измерение 72$77", "Измерение_72_77") #hesh Измерение 72$77  :1    ;0,1 ;3  ;D   ;D < 10^-3   ;±0,025     ;(-0,025)     ;0,025
ParamError("1",   "0,1", "3", "Cp", "10 нФ",       "±0,37 %",    "9,963 нФ",     "10,037 нФ",   "Измерение 73$78", "Измерение_73_78") #hesh Измерение 73$78  :1    ;0,1 ;3  ;Cp  ;10 нФ       ;±0,37 %    ;9,963 нФ     ;10,037 нФ
ParamError("1",   "0,1", "3", "D",  "D < 10^-3",   "±0,010",     "(-0,010)",     "0,010",       "Измерение 74$79", "Измерение_74_79") #hesh Измерение 74$79  :1    ;0,1 ;3  ;D   ;D < 10^-3   ;±0,010     ;(-0,010)     ;0,010

ParamError("1",   "0,1", "4", "Rp", "10 кОм",      "±0,58 %",    "9,942 кОм",    "10,058 кОм",  "Измерение 75$80", "Измерение_75_80") #hesh Измерение 75$80  :1    ;0,1 ;4  ;Rp  ;10 кОм      ;±0,58 %    ;9,942 кОм    ;10,058 кОм
ParamError("1",   "0,1", "4", "Rp", "1 кОм",       "±0,36 %",    "0,9964 кОм",   "1,0036 кОм",  "Измерение 76$81", "Измерение_76_81") #hesh Измерение 76$81  :1    ;0,1 ;4  ;Rp  ;1 кОм       ;±0,36 %    ;0,9964 кОм   ;1,0036 кОм

ParamError("1",   "0,1", "5", "Rs", "1 кОм",       "±0,36 %",    "996,4 Ом",     "1003,6 Ом",   "Измерение 77$82", "Измерение_77_82") #hesh Измерение 77$82  :1    ;0,1 ;5  ;Rs  ;1 кОм       ;±0,36 %    ;996,4 Ом     ;1003,6 Ом
ParamError("1",   "0,1", "5", "Rs", "100 Ом",      "±0,58%",     "99,42 Ом",     "100,58 Ом",   "Измерение 78$83", "Измерение_78_83") #hesh Измерение 78$83  :1    ;0,1 ;5  ;Rs  ;100 Ом      ;±0,58%     ;99,42 Ом     ;100,58 Ом

ParamError("1",   "0,1", "6", "Ls", "10 мГн",      "±0,39 %",    "9,961 мГн",    "10,039 мГн",  "Измерение 79$84", "Измерение_79_84") #hesh Измерение 79$84  :1    ;0,1 ;6  ;Ls  ;10 мГн      ;±0,39 %    ;9,961 мГн    ;10,039 мГн
ParamError("1",   "0,1", "6", "Ls", "5 мГн",       "±0,42 %",    "4,9790 мГн",   "5,0210 мГн",  "Измерение 80$85", "Измерение_80_85") #hesh Измерение 80$85  :1    ;0,1 ;6  ;Ls  ;5 мГн       ;±0,42 %    ;4,9790 мГн   ;5,0210 мГн

MOKO.Program('tree', 'set', 'chosen=passed')
#EndRegion Определение основной погрешности прибора (Таблица 3)

MOKO.EndScript('passed')